[
    {
        "entity": "Alveolar Proteinosis",
        "location": "Lung",
        "image": "Alveolar Proteinosis/Google_08.jpg",
        "description": "a rare disease characterized by positive pas staining in the alveolar and bronchiolar lumens and phospholipid-rich proteins from the lungs, occurs in young and middle-aged adults, with about three times as many males as females.",
        "prevention": "avoid bacterial infection and improve immunity",
        "cause": "decreased immune function, genetic factors, alcohol abuse, microbial infection",
        "symptom": "cyanosis, chest pain, dyspnea, fatigue",
        "treatment": "bronchoalveolar lavage",
        "infectivity": "non-infectious",
        "chunk": "The rare disease is characterized by positive PAS staining in the alveolar and bronchiolar lumens, indicating the presence of phospholipid-rich proteins from the lungs. It predominantly affects young and middle-aged adults, with a higher incidence in males compared to females. Although non-infectious, this condition is associated with decreased immune function, genetic predispositions, alcohol abuse, and microbial infections as potential causes. Symptoms typically include cyanosis, chest pain, dyspnea, and fatigue. To manage and treat the disease, bronchoalveolar lavage is a recommended procedure. Preventative measures include avoiding bacterial infections and bolstering the immune system to mitigate the risk of its onset."
    },
    {
        "entity": "Radiation Pneumonia",
        "location": "Lung",
        "image": "Radiation Pneumonia/Google_13.jpg",
        "description": "radiation pneumonia is an inflammatory reaction caused by damage to normal lung tissue in the radiation field after radiotherapy for lung cancer, breast cancer, esophageal cancer, malignant lymphoma or other malignant tumors in the chest.",
        "prevention": "strict control of radiation dose and timely treatment of disease",
        "cause": "radiotherapy",
        "symptom": "irritant cough, shortness of breath, palpitation, chest pain",
        "treatment": "drug symptomatic treatment mainly, early may need hormone treatment",
        "infectivity": "non-infectious",
        "chunk": "Radiation pneumonia, located in the lungs, is an inflammatory reaction resulting from the damage to normal lung tissue within the radiation field following radiotherapy for various chest-related cancers such as lung cancer, breast cancer, esophageal cancer, and malignant lymphoma. Its prevention involves the strict control of radiation dose and timely medical intervention. The condition is caused by radiotherapy and manifests through symptoms including an irritant cough, shortness of breath, palpitations, and chest pain. Treatment primarily involves drug symptomatic therapy, with early intervention potentially requiring hormone treatment. Importantly, this condition is non-infectious."
    },
    {
        "entity": "Pulmonary Bullae",
        "location": "Lung",
        "image": "Pulmonary Bullae/Google_18.jpg",
        "description": "pulmonary bullae refer to the air-containing sac cavity formed in the lung tissue due to the increase of pressure in the alveolar cavity, the rupture and fusion of alveolar walls due to various reasons",
        "prevention": "stop smoking and prevent bronchopulmonary infection.",
        "cause": "most are secondary to pulmonary and bronchitis lesions, and a few are congenital",
        "symptom": "cough, chest tightness, shortness of breath, dyspnea",
        "treatment": "rehabilitation therapy, surgical treatment",
        "infectivity": "non-infectious",
        "alias": "bullae",
        "chunk": "Pulmonary bullae refer to air-filled sacs that form in lung tissue due to increased pressure in alveolar cavities, leading to the rupture and fusion of alveolar walls. These sacs often develop secondary to issues such as pulmonary or bronchitis lesions, although they can also be congenital. Common symptoms include cough, chest tightness, shortness of breath, and dyspnea. While the condition is non-infectious, prevention strategies focus on avoiding smoking and reducing the risk of bronchopulmonary infections. Treatment options include rehabilitation therapy and surgical interventions. These sacs are also known by the alias bullae."
    },
    {
        "entity": "Pneumonia",
        "location": "Lung",
        "image": "Pneumonia/Google_41.jpg",
        "description": "pneumonia refers to inflammation of the terminal airways, alveoli, and interstitium",
        "prevention": "pay attention to prevent cold and keep warm, enhance physical fitness",
        "cause": "bacterial infection",
        "symptom": "cough foamy mucus sputum, dyspnea, cough, chest pain",
        "treatment": "medical therapy, supportive therapy",
        "infectivity": "non-infectious",
        "chunk": "Pneumonia is a condition characterized by inflammation affecting the terminal airways, alveoli, and interstitium of the lungs. It typically arises from a bacterial infection, leading to symptoms such as coughing, production of foamy mucus sputum, dyspnea, and chest pain. Although this condition is non-infectious, prevention strategies include maintaining overall physical fitness by avoiding cold exposure and keeping warm. The management of this ailment generally includes medical and supportive therapies to alleviate symptoms and promote recovery."
    },
    {
        "entity": "Pulmonary Edema",
        "location": "Lung",
        "image": "Pulmonary Edema/Google_08.jpg",
        "description": "pulmonary edema refers to the extravasation of pulmonary tissue fluid from pulmonary capillaries and accumulation in alveoli, pulmonary interstitium and small bronchioles, resulting in severe impairment of pulmonary ventilation and ventilation function.",
        "prevention": "keep warm and cold-proof to avoid getting cold",
        "cause": "it can be divided into two categories cardiogenic and non-cardiogenic.",
        "symptom": "dyspnea, cyanosis, sweating, cough",
        "treatment": "medication",
        "infectivity": "non-infectious",
        "chunk": "Pulmonary edema occurs in the lung, characterized by the leakage of fluid from pulmonary capillaries into the pulmonary tissue, leading to fluid accumulation in the alveoli, interstitium, and small bronchioles. This condition severely impairs pulmonary ventilation and function. Preventative measures include staying warm and avoiding colds. The causes are categorized into cardiogenic and non-cardiogenic origins. Symptoms typically include dyspnea, cyanosis, sweating, and cough. The condition is non-infectious and is generally treated with medication."
    },
    {
        "entity": "Lung Cancer",
        "location": "Lung",
        "image": "Lung Cancer/Google_31.jpg",
        "description": "lung cancer is one of the malignant tumors with the fastest increase in morbidity and mortality and the greatest threat to human health and life.",
        "prevention": "quit smoking, correct eating habits, pay attention to the respiratory environment",
        "cause": "smoking, occupational exposure, environmental pollution, tuberculosis, chronic inflammation of the lung, heredity",
        "symptom": "cough, blood in sputum, low fever, chest pain, tightness",
        "treatment": "pharmacotherapy, surgical therapy, radiotherapy, chemotherapy, targeted drug therapy",
        "infectivity": "non-infectious",
        "alias": "bronchial lung cancer",
        "chunk": "Lung cancer, also known as bronchial lung cancer, primarily affects the lungs and is distinguished by its rapid increase in both morbidity and mortality, posing a significant threat to human health and life. Key preventive measures include quitting smoking, adopting correct eating habits, and maintaining a healthy respiratory environment. The disease can arise from a variety of causes, such as smoking, occupational exposure, environmental pollution, tuberculosis, chronic lung inflammation, and genetic factors. Individuals with this condition may experience symptoms like coughing, blood in sputum, low fever, chest pain, and a sensation of tightness. Treatment options encompass pharmacotherapy, surgical therapy, radiotherapy, chemotherapy, and targeted drug therapy. It is important to note that this type of cancer is non-infectious."
    },
    {
        "entity": "Respiratory Failure",
        "location": "Respiratory System",
        "image": "Respiratory Failure/Google_20.jpg",
        "description": "respiratory failure is a clinical syndrome in which pulmonary ventilation or ventilation function is severely impaired due to various causes, so that effective gas exchange cannot be carried out, resulting in hypoxia and a series of physiological and metabolic disorders.",
        "prevention": "keep healthy",
        "symptom": "obvious upper pulmonary fibrosis, respiratory failure, dyspnea",
        "treatment": "medication",
        "infectivity": "non-infectious",
        "alias": "respiratory failure",
        "chunk": "Respiratory failure is a clinical syndrome characterized by a significant impairment of pulmonary ventilation or function, which leads to inadequate gas exchange, resulting in hypoxia and various physiological and metabolic disorders. Primarily located within the respiratory system, this condition manifests in symptoms such as obvious upper pulmonary fibrosis and dyspnea. Although it is non-infectious, maintaining good health is recommended as a preventative measure. Treatment typically involves the use of medication to manage and alleviate symptoms."
    },
    {
        "entity": "Silicosis",
        "location": "Lung",
        "image": "Silicosis/Google_08.jpg",
        "description": "it is caused by long-term inhalation of a large amount of free silica dust, mainly caused by extensive nodular fibrosis in the lung.",
        "prevention": "strengthen personal protection during work",
        "cause": "high dust concentration in air and long contact time",
        "symptom": "chest pain, pulmonary fibrosis",
        "treatment": "medication",
        "infectivity": "non-infectious",
        "alias": "silicosis",
        "chunk": "Silicosis is a lung condition resulting from the prolonged inhalation of significant quantities of free silica dust, leading to extensive nodular fibrosis. It occurs when there is a high concentration of dust in the air paired with long-term exposure. Those affected may experience symptoms such as chest pain and pulmonary fibrosis. Although it is not infectious, it requires medication for treatment. To prevent this condition, individuals should enhance personal protective measures during work."
    },
    {
        "entity": "Hypertrophic Obstructive Cardiomyopathy",
        "location": "Heart",
        "image": "Hypertrophic Obstructive Cardiomyopathy/Google_29.jpg",
        "description": "hypertrophic obstructive cardiomyopathy is characterized by ventricular hypertrophy, typically in the left ventricle, particularly in the interventricular septum, and occasionally concentric hypertrophy.",
        "prevention": "avoid tiredness and excitement",
        "cause": "not clear, may be genetic or endocrine disorders",
        "symptom": "dyspnea, precordial pain, fatigue, dizziness, syncope, palpitation, heart failure",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Hypertrophic obstructive cardiomyopathy is a condition that primarily affects the heart, specifically characterized by the thickening of the heart muscle, most often in the left ventricle and particularly in the interventricular septum, although sometimes it may present as concentric hypertrophy. The precise cause of this condition is unclear, but it may have genetic or endocrine origins. It is non-infectious, and the primary approach to prevention includes avoiding excessive tiredness and excitement. Individuals with this condition often exhibit symptoms such as difficulty breathing, chest pain, fatigue, dizziness, fainting, irregular heartbeats, and may develop heart failure. Management of the disease involves both medical and surgical treatments tailored to alleviate symptoms and improve quality of life."
    },
    {
        "entity": "Hypertrophic Cardiomyopathy",
        "location": "Heart",
        "image": "Hypertrophic Cardiomyopathy/Google_08.jpg",
        "description": "hypertrophic cardiomyopathy is a myocardial disease of unknown origin characterized by asymmetric hypertrophy of the ventricular wall",
        "prevention": "avoid tiredness and excitement",
        "cause": "autosomal dominant inheritance",
        "symptom": "palpitations, exertional dyspnea, precordial distress, fatigue, syncope and even sudden death",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "susceptible population": "young adults",
        "chunk": "Hypertrophic cardiomyopathy is a myocardial disease occurring in the heart, characterized by the abnormal thickening of the ventricular wall without a known cause. It is a genetic condition, usually inherited in an autosomal dominant pattern, and primarily affects young adults. Individuals with this condition may experience symptoms such as palpitations, exertional dyspnea, chest pain, fatigue, and syncope, with the possibility of sudden death. Preventive measures include avoiding tiredness and situations that may cause excitement. While it is a non-infectious disease, management can involve both medical and surgical treatments to alleviate symptoms and improve heart function."
    },
    {
        "entity": "Pulmonary Arteriovenous Fistula",
        "location": "Lung",
        "image": "Pulmonary Arteriovenous Fistula/Google_08.jpg",
        "description": "pulmonary arteriovenous fistula as congenital pulmonary vascular malformation",
        "cause": "congenital diseases",
        "symptom": "chest pain, dyspnea, shortness of breath",
        "treatment": "surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "A pulmonary arteriovenous fistula is a congenital pulmonary vascular malformation located in the lung. It is typically caused by congenital diseases and presents with symptoms such as chest pain and difficulties in breathing, including dyspnea and shortness of breath. This condition is non-infectious, distinguishing it from diseases that can be spread through contact. Treatment often involves surgical intervention to correct the abnormal vascular connections and alleviate symptoms."
    },
    {
        "entity": "Coronary Heart Disease",
        "location": "Heart",
        "image": "Coronary Heart Disease/Google_27.jpg",
        "description": "coronary atherosclerosis narrows or obstructs blood vessels, leading to myocardial ischemia, hypoxia or necrosis, known as coronary heart disease",
        "prevention": "control blood pressure, blood lipids, blood sugar, etc.",
        "cause": "atherosclerosis",
        "symptom": "sudden precordial pain, mostly episodic colic or crushing pain",
        "treatment": "drug therapy, coronary artery bypass graft therapy",
        "infectivity": "no infectious.",
        "susceptible population": "middle-aged and elderly people, smokers, hypertensive patients, diabetic patients, obese people",
        "chunk": "Coronary heart disease occurs in the heart when coronary atherosclerosis narrows or obstructs blood vessels, leading to myocardial ischemia, hypoxia, or necrosis. This condition is characterized by sudden precordial pain, often manifesting as episodic colic or crushing pain. It primarily affects middle-aged and elderly individuals, smokers, hypertensive patients, diabetic patients, and those who are obese. Prevention strategies include managing blood pressure, blood lipids, and blood sugar levels. Treatment options encompass drug therapy and coronary artery bypass graft therapy. Notably, coronary heart disease is non-infectious."
    },
    {
        "entity": "Miocardial Infarction",
        "location": "Heart",
        "image": "Miocardial Infarction/Google_14.jpg",
        "description": "coronary artery occlusion and interruption of blood flow cause local necrosis of some myocardium due to severe and persistent ischemia",
        "prevention": "avoid overwork",
        "cause": "overwork, agitation, overeating, cold irritation, constipation, smoking, heavy drinking",
        "symptom": "posterior sternal pain, extensive myocardial necrosis",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "alias": "myocardial infarction",
        "chunk": "A heart attack, also known as myocardial infarction, occurs when a coronary artery occlusion interrupts blood flow, leading to local necrosis of the myocardium due to severe and persistent ischemia. Common causes include overwork, agitation, overeating, cold irritation, constipation, smoking, and heavy drinking. Symptoms typically involve posterior sternal pain and extensive myocardial necrosis. Medical and surgical treatments are available to address this non-infectious condition, with prevention strategies emphasizing the avoidance of overwork."
    },
    {
        "entity": "Cholelithiasis",
        "location": "Gallbladder",
        "image": "Cholelithiasis/Google_08.jpg",
        "description": "cholelithiasis is a disease in which stones occur anywhere in the biliary system, including the gallbladder and bile duct.",
        "prevention": "control excessive cholesterol intake in the diet",
        "cause": "metabolic factors, biliary infection",
        "symptom": "dull pain in right upper abdomen",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "alias": "gallstone",
        "frequent population": "more women than men",
        "chunk": "Cholelithiasis, also known as gallstone disease, affects the biliary system and is characterized by the formation of stones, particularly in the gallbladder and bile duct. It is a non-infectious condition often attributed to metabolic factors and biliary infections. Those suffering from it typically experience dull pain in the right upper abdomen. While it can be managed through medical and surgical treatments, prevention strategies include moderating cholesterol intake in the diet. The disease predominantly affects women more frequently than men."
    },
    {
        "entity": "Hepatic Hemangioma",
        "location": "Liver",
        "image": "Hepatic Hemangioma/Google_08.jpg",
        "description": "hepatic hemangioma is a relatively common benign tumor of the liver, and cavernous hemangioma is the most common clinical tumor.",
        "prevention": "healthy diet, strengthen exercise, keep good mood",
        "cause": "congenital dysplasia, hormone stimulation",
        "symptom": "abdominal discomfort, abdominal mass",
        "treatment": "medication",
        "infectivity": "non-infectious",
        "chunk": "Hepatic hemangioma is a benign tumor found in the liver, with its most prevalent form being the cavernous type, which is also the most common clinical tumor in this organ. Although congenital dysplasia and hormone stimulation are identified as potential causes, adopting a healthy diet, exercising regularly, and maintaining a positive mindset can serve as preventive measures. Individuals with this condition might experience symptoms such as abdominal discomfort or detect an abdominal mass. Management typically involves medication, and the condition is non-infectious, posing no risk of transmission to others."
    },
    {
        "entity": "Colon Cancer",
        "location": "Large Intestine",
        "image": "Colon Cancer/Google_26.jpg",
        "description": "colon cancer is a common malignant tumor of the digestive tract, accounting for the second most common gastrointestinal tract tumors. the predilection sites are the rectum and the junction between rectum and sigmoid colon.",
        "prevention": "healthy diet, enteroscopy",
        "cause": "high fat meal, inadequate cellulose intake",
        "symptom": "abdominal distension, dyspepsia, mucous stool, bloody stool",
        "treatment": "surgical treatment, drug treatment",
        "infectivity": "non-infectious",
        "susceptible population": "patients with chronic colorectal inflammation and family history of familial multiple intestinal polyposis and colon cancer",
        "chunk": "Colon cancer is a common malignant tumor located in the large intestine, primarily affecting the rectum and the junction between the rectum and sigmoid colon. It represents the second most prevalent type of gastrointestinal tract tumor. Preventative measures include maintaining a healthy diet and undergoing enteroscopy. Contributing factors to its development are high-fat meals and inadequate cellulose intake. Symptoms often present as abdominal distension, dyspepsia, mucous stool, and bloody stool. Treatment options typically involve surgical and drug therapies. The condition is non-infectious and individuals more susceptible to it include those with chronic colorectal inflammation and a family history of familial multiple intestinal polyposis and colon cancer."
    },
    {
        "entity": "Colon Injury",
        "location": "Large Intestine",
        "image": "Colon Injury/Google_08.jpg",
        "description": "colon injury is a common cavity organ injury caused by blunt abdominal injury and penetrating injury, and it can also be caused by iatrogenic injury.",
        "prevention": "pay attention to avoid trauma",
        "cause": "blunt injury, iatrogenic injury",
        "symptom": "abdominal pain",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Colon injury is a common type of damage found in the large intestine, often resulting from either blunt abdominal trauma or penetrating wounds, and can also occur as an unintended side effect of medical interventions. This condition, although not infectious, is typically signaled by abdominal pain. Preventative measures include taking care to avoid trauma to the area. If an injury occurs, it can be managed through either medical or surgical interventions, depending on its severity and nature."
    },
    {
        "entity": "Splenic Rupture",
        "location": "Spleen",
        "image": "Splenic Rupture/Google_08.jpg",
        "description": "the spleen is a substantial organ with abundant blood supply and brittle substance, which is easily ruptured by traumatic violence and causes internal hemorrhage.",
        "prevention": "avoid strenuous exercise",
        "cause": "the effect of external violence, severe coughing, sneezing, or sudden postural changes",
        "symptom": "left upper abdominal pain, worsened by deep breathing",
        "treatment": "surgical treatment, drug treatment",
        "infectivity": "non-infectious",
        "chunk": "Spleen injury is characterized by trauma to the spleen, which is a substantial organ with a rich blood supply and a brittle composition, making it susceptible to rupture and internal hemorrhage in the event of traumatic violence. It can occur due to external impacts, intense coughing, sneezing, or abrupt changes in posture. The condition manifests as pain in the left upper abdomen, particularly exacerbated by deep breathing. Although non-infectious, it poses significant health risks and may necessitate medical intervention through surgical or pharmaceutical treatments. To reduce the risk of such an injury, it is advisable to refrain from strenuous physical activities."
    },
    {
        "entity": "Leiomyoma Of Esophagus",
        "location": "Esophagus",
        "image": "Leiomyoma Of Esophagus/Google_08.jpg",
        "description": "it is a benign tumor originating from the smooth muscle of the esophagus.",
        "prevention": "early diagnosis and early treatment",
        "cause": "not clear",
        "symptom": "swallowing obstruction, dull pain behind sternum",
        "treatment": "surgical treatment, drug treatment",
        "infectivity": "non-infectious",
        "chunk": "Esophageal leiomyoma is a benign tumor that forms in the smooth muscle of the esophagus. While the exact cause is not clear, it is important to prioritize early diagnosis and treatment to prevent complications. Typically, it presents with symptoms such as swallowing obstruction and a dull pain behind the sternum. As a non-infectious condition, it does not pose a risk of spreading to others. Treatment options often include surgical intervention or medication to manage symptoms and remove or reduce the tumor."
    },
    {
        "entity": "Primary Liver Cancer",
        "location": "Liver",
        "image": "Primary Liver Cancer/Google_36.jpg",
        "description": "malignant liver tumors",
        "prevention": "actively prevent and treat viral hepatitis, and strengthen mold prevention and detoxification of grain, oil and food",
        "cause": "chemical carcinogens such as cirrhosis, viral hepatitis and aflatoxin",
        "symptom": "abdominal mass, impaired liver function, pain in damaged liver area, hepatomegaly",
        "treatment": "surgical treatment, drug treatment",
        "infectivity": "non-infectious",
        "susceptible population": "40-50 year old male",
        "chunk": "Liver cancer refers to malignant tumors located in the liver. It is primarily caused by chemical carcinogens, with major contributing factors including cirrhosis, viral hepatitis, and aflatoxin exposure. Preventative measures focus on the proactive management and treatment of viral hepatitis and implementing strategies for mold prevention and detoxification in grains, oils, and food. Common symptoms include the presence of an abdominal mass, impaired liver function, pain in the affected liver area, and hepatomegaly. While it is non-infectious, certain populations, particularly males aged 40-50, are more susceptible. Treatment options typically involve surgical and drug interventions to manage the condition effectively."
    },
    {
        "entity": "Bladder Cancer",
        "location": "Bladder",
        "image": "Bladder Cancer/Google_18.jpg",
        "description": "bladder cancer refers to malignant tumors occurring in the bladder mucosa",
        "prevention": "increase water intake",
        "cause": "genetic factors, environmental factors",
        "symptom": "hematuria, bladder irritation, dysuria, upper urinary tract obstruction",
        "treatment": "medical therapy, supportive therapy, radiotherapy",
        "infectivity": "non-infectious",
        "susceptible population": "long-term smokers, workers exposed to aromatic amine chemicals",
        "chunk": "Bladder cancer refers to malignant tumors occurring in the bladder mucosa and is non-infectious. It is often caused by genetic and environmental factors, with long-term smokers and workers exposed to aromatic amine chemicals being particularly susceptible. Symptoms can include hematuria, bladder irritation, dysuria, and upper urinary tract obstruction. Prevention strategies involve increasing water intake to help reduce risk. Various treatment options are available, including medical therapy, supportive therapy, and radiotherapy."
    },
    {
        "entity": "Renal Cyst",
        "location": "Kidney",
        "image": "Renal Cyst/Google_08.jpg",
        "description": "cystic lesions in the kidney that are not related to the outside world",
        "cause": "not clear",
        "symptom": "intermittent dull pain in the waist, abdomen and back",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "susceptible population": "older male",
        "chunk": "Simple renal cysts are cystic lesions occurring within the kidneys, characterized by their sequestration from the external environment. Their exact cause remains unknown, although they are typically non-infectious in nature. Individuals with these cysts may experience intermittent dull pain affecting the waist, abdomen, and back. Both medical and surgical treatment options exist to manage these symptoms. While the condition can affect various populations, it is more commonly observed in older males."
    },
    {
        "entity": "Cerebral Hemorrhage",
        "location": "Brain",
        "image": "Cerebral Hemorrhage/Google_08.jpg",
        "description": "it refers to spontaneous hemorrhage in non-traumatic brain parenchyma with various causes, most of which are caused by vascular rupture of hypertensive arteriolosclerosis.",
        "prevention": "pay attention to the weather, control blood pressure, pay attention to diet",
        "cause": "hypertension with arteriolosclerosis, microaneurysm or microaneurysm rupture",
        "symptom": "coma, partial loss of speech function, brain death, sensory impairment",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "alias": "cerebral haemorrhage",
        "susceptible population": "middle-aged and elderly people, hypertensive patients, cerebrovascular malformations",
        "chunk": "Intracerebral hemorrhage, also known as cerebral haemorrhage, occurs in the brain as a spontaneous bleed in the absence of trauma, primarily due to the rupture of blood vessels weakened by hypertensive arteriolosclerosis. It tends to affect middle-aged and elderly individuals, particularly those with hypertension or cerebrovascular malformations. The condition manifests with symptoms such as coma, partial loss of speech function, brain death, and sensory impairment. While it is non-infectious, effective prevention involves monitoring the weather, controlling blood pressure, and maintaining a healthy diet. Treatment options include both medical and surgical interventions to address the severe and potentially life-threatening consequences."
    },
    {
        "entity": "Cerebral Thrombosis",
        "location": "Brain",
        "image": "Cerebral Thrombosis/Google_08.jpg",
        "description": "cerebral vascular thickening and lumen stenosis occlusion, leading to thrombosis, causing the reduction of regional cerebral blood flow or interruption of blood supply, cerebral ischemia and hypoxia leading to softening and necrosis",
        "prevention": "diet adjustment, smoking and alcohol cessation, law of life",
        "cause": "atherosclerosis, loss of intravascular emboli",
        "symptom": "numbness and weakness of upper and lower limbs, deviation of mouth and eyes, hemiplegia",
        "treatment": "rehabilitation therapy, drug treatment",
        "infectivity": "non-infectious",
        "susceptible population": "middle-aged and elderly people over 50 years old, patients with rheumatic heart disease, patients with hypertension",
        "chunk": "Cerebral thrombosis involves a process of vascular thickening and narrowing within the brain, leading to the formation of a thrombus. This condition results in a reduction of regional blood flow or a complete interruption, causing ischemia, hypoxia, and potential softening and necrosis of cerebral tissue. Primarily affecting middle-aged and elderly individuals over 50, particularly those with underlying conditions like rheumatic heart disease and hypertension, it manifests through symptoms such as limb numbness and weakness, facial asymmetry, and hemiplegia. Atherosclerosis and intravascular emboli loss are key causative factors. Preventative measures include dietary adjustments, cessation of smoking and alcohol, and maintaining a regulated lifestyle. This non-infectious condition is managed through rehabilitation and drug therapy."
    },
    {
        "entity": "Cerebral Arteriosclerosis",
        "location": "Brain",
        "image": "Cerebral Arteriosclerosis/Google_18.jpg",
        "description": "cerebral arteriosclerosis refers to a series of chronic encephalopathy, such as neurasthenia syndrome, caused by multiple cerebral infarctions, softening, necrosis and atrophy after cerebral arteriosclerosis.",
        "prevention": "develop a healthy lifestyle and monitor blood sugar regularly",
        "cause": "diffuse cerebral arteriosclerosis with reduced cerebral blood flow",
        "symptom": "cardiocerebral insufficiency, fatigue, hypertension, memory impairment, dizziness, headache",
        "treatment": "medication",
        "infectivity": "non-infectious",
        "susceptible population": "male middle-aged and elderly over 40 years old",
        "chunk": "Cerebral arteriosclerosis is a condition located in the brain, characterized by a series of chronic encephalopathies resulting from multiple cerebral infarctions, softening, necrosis, and atrophy following the onset of arteriosclerosis. It commonly presents with symptoms such as cardiocerebral insufficiency, fatigue, hypertension, memory impairment, dizziness, and headaches. The primary cause is diffuse arteriosclerosis leading to reduced cerebral blood flow. Middle-aged and elderly men over 40 are particularly susceptible to this non-infectious condition. Prevention involves adopting a healthy lifestyle and regular monitoring of blood sugar levels, while treatment typically involves medication."
    },
    {
        "entity": "Brain Abscess",
        "location": "Brain",
        "image": "Brain Abscess/Google_27.jpg",
        "description": "a suppurative infection of brain tissue caused by pyogenic bacteria.",
        "prevention": "early diagnosis and early treatment",
        "cause": "infected",
        "symptom": "encephalitis, tissue softening and necrosis, increased intracranial pressure",
        "treatment": "antimicrobial therapy",
        "infectivity": "non-infectious",
        "chunk": "Brain abscess is a serious condition occurring within the brain, characterized by an accumulation of pus due to pyogenic bacterial infection, typically following an infection elsewhere in the body. It can manifest with symptoms such as encephalitis, softening and necrosis of brain tissue, and a dangerous rise in intracranial pressure, although the condition itself is not contagious. Effective prevention relies on prompt diagnosis and timely treatment to curb further complications. The primary approach to treating this condition involves the use of antimicrobial therapy to target the bacterial infection."
    },
    {
        "entity": "Parkinson'S Disease",
        "location": "Nervous System",
        "image": "Parkinson'S Disease/Google_08.jpg",
        "description": "common neurodegenerative diseases in middle-aged and elderly people",
        "prevention": "regular physical examination, healthy living environment, attention to geriatric diseases",
        "cause": "genetic factors, environmental factors",
        "symptom": "resting tremor, bradykinesia, myotonia",
        "treatment": "pharmacotherapy, rehabilitation",
        "infectivity": "non-infectious",
        "chunk": "The entity is associated with the nervous system and is known for being one of the prevalent neurodegenerative diseases affecting middle-aged and elderly populations. Its prevention is encouraged through regular physical check-ups, maintaining a healthy living environment, and addressing geriatric health issues. The causes are attributed to both genetic and environmental factors. Symptoms often include resting tremor, bradykinesia, and myotonia. There are treatment options available, including pharmacotherapy and rehabilitation, although it is characterized as non-infectious, meaning it does not spread from person to person."
    },
    {
        "entity": "Radiation Injury Of Nervous System",
        "location": "Nervous System",
        "image": "Radiation Injury Of Nervous System/Google_21.jpg",
        "description": "radiation injury of nervous system refers to the tissue adverse reaction caused by ionizing radiation in various parts of nervous system",
        "prevention": "radiotherapy should be stopped immediately when radiation nerve injury occurs during radiotherapy",
        "cause": "radiation causes nerve tissue damage and inflammation through direct injury, vascular destruction, autoimmunity",
        "symptom": "sleepiness, touch induction, paralysis, sensory loss",
        "treatment": "medication",
        "infectivity": "non-infectious",
        "susceptible population": "tumor patients receiving head and neck radiotherapy",
        "chunk": "Radiation injury of the nervous system encompasses adverse tissue reactions caused by ionizing radiation in various areas within the nervous system. This condition arises when radiation inflicts damage and inflammation to nerve tissues through mechanisms such as direct injury, vascular destruction, and autoimmunity. Tumor patients undergoing radiotherapy to the head and neck are particularly susceptible to developing this injury. Clinically, it manifests with symptoms like sleepiness, heightened touch sensitivity, paralysis, and sensory loss. As the condition is non-infectious, when it occurs during radiotherapy, the immediate cessation of the treatment is crucial for prevention. Treatment typically involves the administration of medication to manage the symptoms and alleviate nerve damage."
    },
    {
        "entity": "Tracheobronchial Foreign Body",
        "location": "Bronchial Tube",
        "image": "Tracheobronchial Foreign Body/Google_17.jpg",
        "description": "tracheobronchial foreign body is a common clinical emergency, foreign body can be stored in the laryngopharyngeal cavity, laryngeal cavity, trachea and bronchus, causing hoarseness, dyspnea, etc.",
        "prevention": "educate children to develop good habits",
        "cause": "foreign body misenters airway",
        "symptom": "severe cough, bluish complexion, hoarseness, dyspnea",
        "treatment": "surgical treatment",
        "infectivity": "non-infectious",
        "susceptible population": "children under 2 years of age",
        "chunk": "A tracheobronchial foreign body is a common clinical emergency where a foreign object enters the airway, potentially lodging in the laryngopharyngeal cavity, laryngeal cavity, trachea, or bronchus. This can lead to symptoms such as severe cough, hoarseness, bluish complexion, and difficulty breathing. The condition is non-infectious and primarily affects children under two years of age. Preventative measures include educating children to develop good habits, while surgical intervention is often required for treatment."
    },
    {
        "entity": "Thymoma",
        "location": "Thymus",
        "image": "Thymoma/Google_18.jpg",
        "description": "thymoma is a tumor derived from thymic epithelium.",
        "prevention": "early detection, early diagnosis, early treatment",
        "cause": "not clear",
        "symptom": "chest pain, chest tightness, cough, anterior chest discomfort",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Thymoma is a tumor originating from thymic epithelium located in the thymus. It is characterized by symptoms such as chest pain, chest tightness, cough, and anterior chest discomfort, although its precise cause remains unclear. Being non-infectious, it does not spread from person to person. Effective management relies heavily on early detection, diagnosis, and treatment, which can involve both medical and surgical interventions."
    },
    {
        "entity": "Sternal Fracture",
        "location": "Skeleton",
        "image": "Sternal Fracture/Google_08.jpg",
        "description": "fractures often caused by direct violence or compressive forces acting on the chest",
        "prevention": "pay attention to daily life safety",
        "cause": "direct violent impact",
        "symptom": "swelling of sternum, tenderness, injury to respiratory tract, thoracic vessels or spine",
        "treatment": "medical treatment, rehabilitation treatment, surgical treatment",
        "infectivity": "non-infectious",
        "susceptible population": "traffic accident patients",
        "chunk": "Sternal fractures are injuries typically resulting from a direct, violent impact or compressive forces affecting the chest area. Preventive measures include being mindful of safety in everyday life, as these injuries are particularly non-infectious. Symptoms often include swelling and tenderness of the sternum and may involve complications such as damage to the respiratory tract, thoracic vessels, or the spine. Treatments for these fractures can be diverse, encompassing medical, rehabilitation, and surgical options, depending on the severity and associated complications. Although anyone can potentially suffer from such fractures, individuals who have been in traffic accidents are particularly susceptible to this type of injury."
    },
    {
        "entity": "Lateral Ventricular Tumors",
        "location": "Ventricle",
        "image": "Lateral Ventricular Tumors/Google_19.jpg",
        "description": "tumors located in the lateral ventricle",
        "prevention": "early detection, early diagnosis, early treatment",
        "cause": "environmental factors, genetic factors, metabolic factors",
        "symptom": "coma, headache, memory loss, nausea",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "susceptible population": "common in young people",
        "chunk": "Ventricular tumors are found in the lateral ventricle of the brain. These growths can result from a mix of environmental, genetic, and metabolic factors. They are characterized by symptoms such as coma, headaches, memory loss, and nausea. Although the tumors are non-infectious, they predominantly affect young individuals. Effective management relies on early detection, accurate diagnosis, and prompt treatment, which may involve medical or surgical interventions."
    },
    {
        "entity": "Third Ventricular Tumors",
        "location": "Ventricle",
        "image": "Third Ventricular Tumors/Google_10.jpg",
        "description": "third ventricular tumors refer to tumors that originate in or protrude from the third ventricle into the third ventricle.",
        "prevention": "healthy diet and exercise",
        "cause": "environmental factors, immune factors",
        "symptom": "headache, decreased vision",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "susceptible population": "adult",
        "chunk": "Third ventricular tumors occur in the ventricle region and are characterized by tumors originating in or extending into the third ventricle. While their exact cause is linked to environmental and immune factors, maintaining a healthy diet and regular exercise may serve as preventive measures. These tumors can lead to symptoms such as headaches and decreased vision. Medical and surgical treatment options are available to manage the condition. They are non-infectious and primarily affect the adult population."
    },
    {
        "entity": "Cervical Canal Stenosis",
        "location": "Skeleton",
        "image": "Cervical Canal Stenosis/Google_08.jpg",
        "description": "the cervical canal is reduced in all directions, or in volume.",
        "prevention": "pay attention to rest, neck massage",
        "cause": "disc herniation, tumor, simple degeneration",
        "symptom": "numbness, allergy or pain in limbs, weakness and dizziness in limbs",
        "treatment": "surgical treatment, drug treatment, rehabilitation treatment",
        "infectivity": "non-infectious",
        "chunk": "Cervical canal stenosis occurs in the skeleton, where the cervical canal is diminished in all directions or in volume. This condition is often caused by disc herniation, tumors, or simple degeneration. Individuals may experience symptoms such as numbness, allergic reactions, or pain in the limbs, along with weakness and dizziness. Although it is non-infectious, management includes paying attention to rest and considering neck massages to prevent aggravation. Treatment options include surgical procedures, medication, and rehabilitation therapies to alleviate symptoms and improve quality of life."
    },
    {
        "entity": "Spina Bifida",
        "location": "Spine",
        "image": "Spina Bifida/Google_18.jpg",
        "description": "a common congenital malformation of spina bifida.",
        "prevention": "pay attention to pregnancy observation",
        "cause": "abnormal embryonic development",
        "symptom": "spinal canal defect, cyst",
        "treatment": "medical treatment, rehabilitation treatment, surgical treatment",
        "infectivity": "non-infectious",
        "alias": "spinal canal insufficiency",
        "chunk": "Spinal canal insufficiency is located in the spine and represents a prevalent congenital malformation associated with spina bifida. It arises from abnormal embryonic development and is characterized by defects in the spinal canal, sometimes manifesting as a cyst. It is important to vigilantly monitor pregnancy to help prevent its occurrence. This condition is non-infectious and can be managed through a combination of medical interventions, rehabilitation therapies, and surgical procedures."
    },
    {
        "entity": "Intracranial Aneurysm",
        "location": "Brain",
        "image": "Intracranial Aneurysm/Google_08.jpg",
        "description": "intracranial aneurysm refers to a kind of aneurysmal protrusion of the artery wall caused by the limited abnormal enlargement of the lumen of the cerebral artery.",
        "prevention": "healthy diet and exercise",
        "cause": "hypertension, atherosclerosis",
        "symptom": "headache",
        "treatment": "surgical treatment, drug treatment",
        "infectivity": "non-infectious",
        "chunk": "Intracranial aneurysm is a condition characterized by an outpouching of the artery wall in the brain due to the abnormal enlargement of a cerebral artery's lumen. It is primarily caused by hypertension and atherosclerosis, and one of its common symptoms includes headaches. As a non-infectious health issue, it cannot spread from person to person. Prevention strategies involve maintaining a healthy diet and regular exercise to potentially mitigate risk factors. Treatment options include surgical interventions and drug therapies to manage or repair the affected arteries."
    },
    {
        "entity": "Cerebral Hernia",
        "location": "Brain",
        "image": "Cerebral Hernia/Google_08.jpg",
        "description": "when there is a space-occupying lesion in a sublumen of the cranial cavity, the pressure of the sublumen is higher than that of the adjacent sublumen, and the brain tissue shifts from the high pressure area to the low pressure area, thus causing a series of clinical syndromes.",
        "prevention": "early detection and treatment",
        "cause": "any large intracranial space-occupying lesion",
        "symptom": "severe headache, vomiting, drowsiness",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Brain herniation occurs when a space-occupying lesion within a section of the cranial cavity causes an increase in pressure, resulting in the displacement of brain tissue into adjacent areas of lower pressure, leading to a variety of clinical syndromes. It is characterized by symptoms such as severe headache, vomiting, and drowsiness. Prevention relies on the early detection and treatment of intracranial abnormalities to avoid the development of significant pressure discrepancies within the brain. This condition is typically caused by large lesions within the cranium and can be addressed through medical or surgical interventions, depending on the severity and underlying cause. Fortunately, it is non-infectious and poses no risk of transmission between individuals."
    },
    {
        "entity": "Meningioma",
        "location": "Brain",
        "image": "Meningioma/Google_08.jpg",
        "description": "derivatives originating in meninges and meningeal spaces",
        "prevention": "avoid harmful substances and improve body immunity",
        "cause": "environmental factors, genetic factors, metabolic factors",
        "symptom": "hydrocephalus, frontal mass, increased intracranial pressure",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Meningiomas are tumor-like formations situated in the brain, arising from the protective meninges or the spaces surrounding them. These formations are not contagious, developing instead due to a blend of environmental influences, genetic predispositions, and metabolic imbalances. Symptoms often include hydrocephalus, a noticeable mass in the frontal brain region, and a rise in intracranial pressure. Management of the condition involves both medical and surgical interventions. Preventative measures focus on steering clear of detrimental substances and bolstering the body's immune defenses."
    },
    {
        "entity": "Renal Cortical Abscess",
        "location": "Kidney",
        "image": "Renal Cortical Abscess/Google_20.jpg",
        "description": "a hematogenous disease caused by infection of the renal cortex.",
        "prevention": "active management of staphylococcus aureus infection",
        "cause": "most are caused by blood-borne spread of staphylococcus aureus from distant infection foci",
        "symptom": "chills, fatigue, weight loss, low back pain",
        "treatment": "surgical treatment, drug treatment",
        "infectivity": "non-infectious",
        "chunk": "Renal cortical abscess is a condition characterized by a hematogenous disease in the kidney, specifically due to an infection of the renal cortex. It typically arises from a blood-borne spread of staphylococcus aureus originating from remote infection sites. Patients often experience symptoms such as chills, fatigue, weight loss, and low back pain. Although the condition is non-infectious, prevention focuses on managing staphylococcus aureus infections actively. Effective treatment options include both surgical and drug interventions."
    },
    {
        "entity": "Rectal Cancer",
        "location": "Large Intestine",
        "image": "Rectal Cancer/Google_29.jpg",
        "description": "rectal cancer is a cancer that extends from the dentate line to the rectosigmoid junction.",
        "prevention": "healthy diet, strengthen exercise, avoid smoking and alcohol",
        "cause": "environmental factors, diet",
        "symptom": "abdominal distension, hematochezia, abdominal pain",
        "treatment": "surgical treatment, drug treatment",
        "infectivity": "non-infectious",
        "susceptible population": "about 45 years old",
        "chunk": "Rectal cancer is a malignancy found in the lower part of the large intestine, extending from the dentate line to the rectosigmoid junction. This disease can be influenced by environmental factors and diet and primarily affects individuals around the age of 45. Though it is non-infectious, adopting preventive measures such as maintaining a healthy diet, engaging in regular exercise, and avoiding smoking and alcohol can help reduce risk. Common symptoms include abdominal distension, hematochezia, and abdominal pain. For treatment, both surgical and drug options are available to manage and potentially cure the disease."
    },
    {
        "entity": "Jaw Fracture",
        "location": "Skeleton",
        "image": "Jaw Fracture/Google_08.jpg",
        "description": "external force is too large to cause discontinuity of jaw continuity",
        "prevention": "pay attention to daily life safety",
        "cause": "trauma",
        "symptom": "local pain, swelling, abnormal movement of broken ends of bones, displacement of fracture segments, disorganized occlusion",
        "treatment": "supportive therapy, rehabilitation therapy, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "A jaw fracture is an injury occurring within the skeleton when an external force is excessively applied, resulting in a break in the jaw's normal structure. It is primarily caused by trauma and can manifest through symptoms such as localized pain, swelling, abnormal movement at the fracture site, displacement of bone segments, and disorganized occlusion. Although it is non-infectious, addressing it requires careful intervention, which may include supportive therapy, rehabilitation therapy, or surgical treatment. To mitigate the risk of such injuries, it is advised to exercise caution in daily activities to ensure safety and prevent trauma."
    },
    {
        "entity": "Temporomandibular Dislocation",
        "location": "Joint",
        "image": "Temporomandibular Dislocation/Google_21.jpg",
        "description": "mandibular exfoliation from articular fossa and unable to return to radiography",
        "prevention": "avoid trauma",
        "cause": "yawning, singing, laughing, eating with open mouth, opening mouth for a long time and other activities, external injury",
        "symptom": "mandibular protrusion, unable to close mouth, dysphagia",
        "treatment": "rehabilitation therapy, supportive therapy, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Mandibular dislocation is a condition characterized by the displacement of the mandible from the articular fossa, resulting in difficulty returning the jaw to its normal position as observed on radiographic images. It is often caused by activities such as yawning, singing, laughing, or eating with the mouth wide open, as well as by maintaining an open-mouth position for an extended time or through external injury. Avoiding trauma can help prevent this condition. Symptoms include noticeable protrusion of the mandible, inability to close the mouth, and difficulty swallowing. Treatment options range from rehabilitation and supportive therapies to surgical intervention, and the condition is non-infectious."
    },
    {
        "entity": "Breast Fibroadenoma",
        "location": "Heart",
        "image": "Breast Fibroadenoma/Google_21.jpg",
        "description": "breast fibroadenoma is a benign tumor consisting of a mixture of glandular epithelium and fibrous tissue.",
        "prevention": "check regularly and keep a good rest and mood",
        "cause": "oversecretion of estrogen",
        "symptom": "painless breast mass",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "susceptible population": "young women",
        "chunk": "Breast fibroadenoma is a benign tumor found in the heart consisting of a mixture of glandular epithelium and fibrous tissue. It is non-infectious and primarily affects young women due to oversecretion of estrogen. A common symptom is a painless breast mass. To prevent it, individuals are advised to check regularly and maintain good rest and mood. Treatment options include both medical and surgical methods."
    },
    {
        "entity": "Small Intestinal Tumor",
        "location": "Small Intestine",
        "image": "Small Intestinal Tumor/Google_15.jpg",
        "description": "tumors arising in the small intestinal tract",
        "prevention": "early detection, early diagnosis, early treatment",
        "cause": "not clear",
        "symptom": "abdominal pain, intestinal bleeding, intestinal obstruction, mass, intestinal perforation",
        "treatment": "surgical treatment, drug treatment",
        "infectivity": "non-infectious",
        "chunk": "Small intestine tumors are growths that develop within the small intestinal tract. Though the exact cause of these tumors is not well understood, their presence can lead to various symptoms such as abdominal pain, intestinal bleeding, obstruction, a notable mass, and in severe cases, perforation of the intestine. Effective prevention hinges on early detection, diagnosis, and treatment. These tumors are non-infectious and are typically managed through surgical and/or drug treatments."
    },
    {
        "entity": "Heart Disease",
        "location": "Heart",
        "image": "Heart Disease/Google_40.jpg",
        "description": "heart disease is the general term for heart disease",
        "prevention": "avoid tobacco and alcohol, develop good habits, and live a regular life",
        "cause": "arteriosclerosis, hypertension, viral infections, respiratory diseases",
        "symptom": "palpitations, angina, dyspnea, cough, hemoptysis, chest pain, chest discomfort",
        "treatment": "surgical treatment, interventional treatment, drug treatment",
        "infectivity": "non-infectious",
        "chunk": "Heart disease, a prevalent condition affecting the heart, encompasses various ailments that impair cardiac function. This ailment can arise from multiple causes including arteriosclerosis, hypertension, viral infections, and respiratory diseases. Individuals affected may experience symptoms such as palpitations, angina, dyspnea, cough, hemoptysis, chest pain, and chest discomfort, all of which necessitate medical evaluation. While the condition itself is non-infectious, it requires appropriate management to mitigate its impact on health. Treatment options include surgical intervention, interventional procedures, and the use of medications. Effective prevention strategies focus on lifestyle choices, such as avoiding tobacco and alcohol, cultivating healthy habits, and maintaining a regular and balanced routine to reduce the risk of developing this widespread health issue."
    },
    {
        "entity": "Thyroid Nodules",
        "location": "Thyroid",
        "image": "Thyroid Nodules/Google_08.jpg",
        "description": "thyroid nodule refers to a mass in the thyroid gland, which can move up and down with the swallowing movement. it is a common clinical condition and can be caused by a variety of etiologies.",
        "prevention": "control mood, reasonable iodine intake, and enhance system",
        "cause": "genetic factors, radiation, iodine deficiency",
        "symptom": "thyroid may be enlarged",
        "treatment": "medical treatment, rehabilitation treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "A thyroid nodule is a mass found in the gland located in the neck, known for its ability to move with swallowing. This prevalent clinical condition can arise due to diverse causes, including genetic factors, radiation exposure, and iodine deficiency. Although the thyroid may become enlarged, indicating the presence of the nodule, it is not an infectious condition. Proper management involves various treatment options such as medical, rehabilitation, and surgical interventions. To help prevent its occurrence or exacerbation, it is advisable to manage stress levels, ensure appropriate iodine consumption, and strengthen the body's systems."
    },
    {
        "entity": "Intestinal Cancer",
        "location": "Large Intestine",
        "image": "Intestinal Cancer/Google_22.jpg",
        "description": "colorectal cancer is a common malignancy, including colon and rectal cancer",
        "prevention": "pay attention to diet and strengthen exercise",
        "cause": "chronic inflammation of the large intestine, colorectal adenoma, genetic factors",
        "symptom": "dyspepsia, fecal occult blood",
        "treatment": "surgical treatment, medical treatment, radiotherapy",
        "infectivity": "non-infectious",
        "chunk": "Colorectal cancer is a prevalent form of cancer that affects the colon and rectum. It is characterized by chronic inflammation, colorectal adenomas, and genetic predispositions. Symptoms often include issues with digestion, such as dyspepsia, and the presence of blood in the stool that is not visible to the naked eye. Though non-infectious, its development is influenced by certain genetic and environmental factors. To reduce the risk, attention should be given to maintaining a healthy diet and regular physical activity. It can be managed through surgical intervention, medication, and radiotherapy, depending on the stage and progression of the disease."
    },
    {
        "entity": "Oral Hemangioma",
        "location": "Oral Cavity",
        "image": "Oral Hemangioma/Google_26.jpg",
        "description": "oral hemangioma is a common benign tumor in oral and maxillofacial region",
        "prevention": "light diet, avoid spicy and irritating food",
        "cause": "congenital diseases",
        "symptom": "appears as bright red or purple-red plaques",
        "treatment": "medical treatment, surgical treatment, interventional treatment",
        "infectivity": "non-infectious",
        "chunk": "An oral hemangioma is a common benign tumor in the oral and maxillofacial region. It is usually caused by congenital diseases and presents as bright red or purple-red plaques in the oral cavity. It is non-infectious and can be managed through various treatments, including medical, surgical, and interventional methods. To prevent exacerbation, individuals are advised to maintain a light diet and avoid spicy and irritating foods."
    },
    {
        "entity": "Cholangioma",
        "location": "Gallbladder",
        "image": "Cholangioma/Google_26.jpg",
        "description": "tumors of the biliary system, including gallbladder and bile duct tumors, can be classified as benign and malignant.",
        "prevention": "eat a healthy diet and check regularly",
        "cause": "biliary calculi, chronic inflammation of biliary tract",
        "symptom": "abdominal discomfort, weight loss, loss of appetite, abdominal pain",
        "treatment": "surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Gallbladder tumors, found in the biliary system, can be either benign or malignant. Maintaining a healthy diet and regular check-ups are suggested preventive measures. These tumors are often caused by biliary calculi and chronic inflammation of the biliary tract. Symptoms include abdominal discomfort, weight loss, loss of appetite, and abdominal pain. Surgical treatment is the primary method of addressing these tumors, which are non-infectious in nature."
    },
    {
        "entity": "Lipoma Of Breast",
        "location": "Breast",
        "image": "Lipoma Of Breast/Google_08.jpg",
        "description": "breast lipoma is a benign tumor derived from breast adipose tissue.",
        "prevention": "healthy diet, strengthen exercise, avoid smoking and alcohol",
        "cause": "liver qi disturbance",
        "symptom": "breast pain, breast mass, breast swelling pain",
        "treatment": "surgical treatment, medical treatment, supportive treatment",
        "infectivity": "non-infectious",
        "texture": "soft",
        "chunk": "A breast lipoma is a benign tumor originating from adipose tissue in the breast. It can cause breast pain, the presence of a mass, and swelling pain, but it is non-infectious with a soft texture. Prevention measures include maintaining a healthy diet, engaging in regular exercise, and avoiding smoking and alcohol. The condition is often linked to liver qi disturbance and can be addressed through surgical, medical, or supportive treatment options."
    },
    {
        "entity": "Splenomegaly",
        "location": "Spleen",
        "image": "Splenomegaly/Google_08.jpg",
        "description": "enlarged spleen volume is the main manifestation of splenic disease",
        "prevention": "develop good habits, physical examination",
        "cause": "viral infection, bacterial infection, parasitic infection, hepatitis",
        "symptom": "enlarged spleen",
        "treatment": "pharmacotherapy, rehabilitation",
        "infectivity": "non-infectious",
        "chunk": "Enlarged spleen volume is the main manifestation of splenic disease, located in the spleen. Good habits and regular physical examinations can help prevent its occurrence. It is primarily caused by infections, including viral, bacterial, and parasitic, as well as hepatitis. The main symptom is an increase in the size of the spleen. Treatment options include pharmacotherapy and rehabilitation. Despite being associated with various infections, it is non-infectious in nature."
    },
    {
        "entity": "Pulmonary Fibrosis",
        "location": "Lung",
        "image": "Pulmonary Fibrosis/Google_26.jpg",
        "description": "abnormal repair of normal alveolar tissue after damage results in structural abnormalities",
        "prevention": "quit smoking, strengthen physical exercise, physical examination",
        "cause": "long-term smoking, environmental factors, chronic bronchitis and other lung diseases",
        "symptom": "chest tightness, dyspnea",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Pulmonary fibrosis is characterized by the abnormal repair of alveolar tissue after damage, leading to structural abnormalities in the lungs. It is typically caused by long-term smoking, various environmental factors, chronic bronchitis, and other lung diseases. Symptoms often include chest tightness and difficulty breathing. Preventative measures are recommended, such as quitting smoking, engaging in regular physical exercise, and undergoing routine physical examinations. Treatment options include both medical and surgical interventions. Importantly, this condition is not infectious."
    },
    {
        "entity": "Brain Edema",
        "location": "Brain",
        "image": "Brain Edema/Google_24.jpg",
        "description": "brain edema refers to the pathological phenomenon of brain volume increase caused by the increase of water in brain, and is the response of brain tissue to various pathogenic factors.",
        "cause": "craniocerebral injury, intracranial space-occupying lesions, intracranial inflammation, cerebrovascular lesions, cerebral hypoxia",
        "symptom": "encephalomalacia, local edema, confusion, increased intracranial pressure",
        "prevention": "treat brain diseases promptly, keep healthy",
        "treatment": "pharmacotherapy, rehabilitation",
        "infectivity": "non-infectious",
        "chunk": "Brain edema is characterized by an increase in brain volume resulting from the accumulation of water within brain tissue, occurring as a reaction to various damaging factors. These factors include injuries to the head, lesions occupying space within the skull, inflammatory conditions inside the cranium, vascular incidents affecting the brain, and situations leading to insufficient oxygen supply to brain cells. Symptoms may manifest as localized edema, areas of softened brain tissue known as encephalomalacia, confusion, and elevated pressure within the skull, all of which can pose significant health risks. Preventive measures focus on the prompt treatment of brain-related ailments and maintaining overall health. Management options typically involve medication and rehabilitation to alleviate symptoms and reduce swelling. Importantly, it is not an infectious condition."
    },
    {
        "entity": "Renal Neoplasms",
        "location": "Kidney",
        "image": "Renal Neoplasms/Google_16.jpg",
        "description": "renal tumors are one of the more common tumors of the urinary system.",
        "prevention": "eat a healthy diet and maintain good living habits",
        "cause": "not clear",
        "symptom": "fever, anemia, hypertension",
        "treatment": "medical treatment, rehabilitation treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Renal tumors, which are frequently found within the urinary system, are non-infectious growths located in the kidneys. Although the specific causes are unclear, symptoms often include fever, anemia, and hypertension. These tumors can be addressed through various treatment methods including medical and surgical interventions, as well as rehabilitation therapies. While the exact prevention strategies are not definitive, maintaining a healthy diet and good living habits may help reduce the risk of developing these tumors."
    },
    {
        "entity": "Bone Cancer",
        "location": "Skeleton",
        "image": "Bone Cancer/Google_17.jpg",
        "description": "bone cancer is a malignant tumor of bone",
        "prevention": "eat a healthy diet, maintain good living habits and avoid radiation",
        "cause": "overgrowth, chronic inflammation, genetic factors, secondary acquisition",
        "symptom": "lump, pain",
        "treatment": "surgical treatment, radiotherapy, drug treatment",
        "infectivity": "non-infectious",
        "susceptible population": "all populations",
        "alias": "malignant bone tumors",
        "chunk": "Bone cancer is a serious condition characterized by the presence of malignant tumors within the bones. The disease is potentially influenced by factors such as overgrowth, chronic inflammation, genetic predispositions, and secondary acquisitions, resulting in symptoms that commonly include lumps and pain. While the cancer is non-infectious and can affect individuals across all demographics, maintaining a healthy diet, adopting positive living habits, and avoiding radiation may help in preventing its onset. Treatment options predominantly involve a combination of surgical procedures, radiotherapy, and pharmacological interventions in order to combat the growth and spread of the tumors."
    },
    {
        "entity": "Breast Mass",
        "location": "Breast",
        "image": "Breast Mass/Google_04.jpg",
        "description": "breast mass is a common sign of breast disease",
        "prevention": "keep a good mood, keep regular sleep, and eat reasonably",
        "cause": "endocrine disorders, mood, induced abortion, unreasonable dietary structure",
        "symptom": "breast swelling, pain, unequal size, ill-defined nodules",
        "treatment": "medical therapy, supportive therapy",
        "infectivity": "non-infectious",
        "chunk": "A breast mass is a common indication of breast disease and can manifest with symptoms such as swelling, pain, unequal breast size, and ill-defined nodules. The condition is not infectious and does not spread from person to person. While the precise causes include endocrine disorders, mood fluctuations, abortions, and an unreasonable dietary structure, maintaining a good mood, regular sleep, and a balanced diet can aid in prevention. Treatment options usually involve medical and supportive therapies to manage the symptoms and address underlying issues."
    },
    {
        "entity": "Lipoma Of Large Intestine",
        "location": "Large Intestine",
        "image": "Lipoma Of Large Intestine/Google_10.jpg",
        "description": "it is a benign tumor of large intestine.",
        "prevention": "physical examination",
        "cause": "it is not clear, possibly related to inflammation and stimulation",
        "symptom": "hematochezia, abdominal pain, intussusception, change of stool habits, emaciation",
        "treatment": "surgical treatment, medical treatment, supportive treatment",
        "infectivity": "non-infectious",
        "chunk": "Colon adenomatous polyps are benign tumors found in the large intestine. Despite unclear causes, they may be linked to inflammation and subsequent stimulation. Symptoms could include hematochezia, abdominal pain, intussusception, changes in stool habits, and emaciation. Regular physical examinations are advised for prevention. Although non-infectious, managing these polyps might involve surgical, medical, or supportive treatments to address varying symptoms and prevent potential complications."
    },
    {
        "entity": "Tumor Of Biliary Tract",
        "location": "Gallbladder",
        "image": "Tumor Of Biliary Tract/Google_08.jpg",
        "description": "biliary tract tumors mainly refer to tumors originating from the biliary system, including gallbladder tumors and bile duct tumors.",
        "prevention": "regular inspection",
        "cause": "not clear, possibly related to stones",
        "symptom": "dyspepsia, greasy, belching, abdominal distension",
        "treatment": "surgical treatment, supportive treatment",
        "infectivity": "non-infectious",
        "chunk": "Biliary tract tumors are a type of cancer originating within the biliary system, which encompasses both gallbladder and bile duct tumors. These tumors are non-infectious and often associated with unclear causes, though there may be a potential link to gallstones. Symptoms commonly include digestive issues such as dyspepsia, excessive belching, a greasy feeling, and abdominal distention. Surgical intervention is typically the primary approach to treatment, often supplemented by supportive care to manage symptoms and improve quality of life. Regular medical check-ups can serve as a preventive measure to catch the disease early or monitor individuals at risk."
    },
    {
        "entity": "Lymphocarcinoma",
        "location": "Lymph",
        "image": "Lymphocarcinoma/Google_21.jpg",
        "description": "malignant tumors originating from lymph nodes or other lymphoid tissues",
        "prevention": "maintain optimistic mood, strengthen physical exercise and regularity of life",
        "cause": "viral infection, low immunity",
        "symptom": "fever of unknown origin, splenomegaly, lymphadenopathy, night sweats",
        "treatment": "medical treatment, surgical treatment, supportive treatment",
        "infectivity": "non-infectious",
        "chunk": "Lymphoma refers to malignant tumors arising from lymph nodes or lymphoid tissues. This condition can result from viral infections or low immunity, and it typically presents with symptoms such as unexplained fever, enlargement of the spleen, swelling of the lymph nodes, and night sweats. While it is non-infectious, treatments involve a combination of medical, surgical, and supportive approaches. Preventive measures focus on maintaining a positive attitude, engaging in regular physical activity, and leading a well-regulated lifestyle."
    },
    {
        "entity": "Liver Tumors",
        "location": "Liver",
        "image": "Liver Tumors/Google_25.jpg",
        "description": "liver tumors are neoplastic lesions that occur in the liver.",
        "prevention": "early detection, early diagnosis, early treatment",
        "cause": "liver cirrhosis, viral hepatitis, chemical carcinogens, aflatoxins",
        "symptom": "decreased appetite, nausea, hepatomegaly",
        "treatment": "surgical treatment, chemotherapy, radiotherapy, targeted drug therapy",
        "infectivity": "non-infectious",
        "chunk": "Liver tumors are neoplastic lesions found in the liver, primarily arising due to conditions such as liver cirrhosis, viral hepatitis, exposure to chemical carcinogens, and ingestion of aflatoxins. These growths are characterized by symptoms including decreased appetite, nausea, and hepatomegaly. While the neoplasms are non-infectious, proactive measures such as early detection, diagnosis, and treatment can aid in prevention and management. Treatment options encompass surgical procedures, chemotherapy, radiotherapy, and targeted drug therapy, all aimed at addressing the growths and mitigating their impact."
    },
    {
        "entity": "Adrenal Tumors",
        "location": "Adrenal Gland",
        "image": "Adrenal Tumors/Google_08.jpg",
        "description": "the classification of adrenal tumors can be divided into benign tumors and malignant tumors according to their nature",
        "cause": "not clear",
        "symptom": "limb weakness, low back pain, dizziness",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Adrenal tumors occur in the adrenal gland and are classified as either benign or malignant based on their characteristics. The exact cause of these tumors is not well understood. Individuals with this condition may experience symptoms such as limb weakness, low back pain, and dizziness. Treatment options include both medical and surgical methods. These tumors are non-infectious, meaning they do not spread from person to person."
    },
    {
        "entity": "Renal Atrophy",
        "location": "Kidney",
        "image": "Renal Atrophy/Google_15.jpg",
        "description": "renal atrophy refers to the loss of nephron or insufficient blood supply to the kidney caused by various reasons, resulting in reduced kidney volume and reduced physiological function.",
        "prevention": "limit protein and fat intake and eat a healthy diet",
        "cause": "congenital, renal parenchymal disease, secondary kidney disease",
        "symptom": "low back pain, nausea, vomiting, hematuria, leg and foot edema",
        "treatment": "medication",
        "infectivity": "non-infectious",
        "chunk": "Renal atrophy occurs when there is a loss of nephrons or insufficient blood supply due to various causes, leading to reduced kidney volume and impaired physiological function. This condition, which affects the kidneys, can arise from congenital factors, renal parenchymal disease, or secondary kidney disease. Symptoms may include low back pain, nausea, vomiting, hematuria, and edema in the legs and feet. It is non-infectious and typically managed with medication. Preventative measures involve limiting protein and fat intake and maintaining a healthy diet."
    },
    {
        "entity": "Brain Cancer",
        "location": "Brain",
        "image": "Brain Cancer/Google_41.jpg",
        "description": "brain malignant tumors",
        "prevention": "eat a healthy diet and maintain good living habits",
        "cause": "genetic factors, radiation, chemicals, viruses",
        "symptom": "headache, vomiting",
        "treatment": "surgical treatment, medical treatment, physiotherapy, radiotherapy",
        "infectivity": "non-infectious",
        "chunk": "Brain cancer involves malignant tumors located in the brain and poses serious health challenges. Though prevention can be aided by maintaining a healthy diet and adopting good living habits, the condition often arises due to genetic factors, exposure to radiation, and contact with certain chemicals or viruses. Individuals with these tumors may experience symptoms such as headaches and vomiting. Comprehensive treatment often includes a combination of surgical options, medication, physiotherapy, and radiotherapy. Importantly, it is non-infectious, meaning it cannot be transmitted from person to person."
    },
    {
        "entity": "Brain Tumour",
        "location": "Brain",
        "image": "Brain Tumour/Google_40.jpg",
        "description": "brain tumor is a tumor that grows in a certain part of the brain",
        "prevention": "pay attention to dietary hygiene, strengthen physical fitness and avoid brain trauma",
        "cause": "brain embryonic tissue dysplasia, genetic factors, chemical factors",
        "symptom": "visual impairment, vomiting, tinnitus, increased intracranial pressure",
        "treatment": "medical treatment, supportive treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "A brain tumor is a growth within a particular section of the brain and is not contagious. Its development can be attributed to factors such as dysplasia of brain embryonic tissue, genetic predispositions, and exposure to certain chemicals. Those affected may experience symptoms including visual impairment, vomiting, tinnitus, and heightened intracranial pressure. To manage or mitigate the condition, individuals can undergo medical, supportive, or surgical treatments. Preventive measures include maintaining good dietary hygiene, enhancing physical fitness, and avoiding head injuries."
    },
    {
        "entity": "Pulmonary Nodules",
        "location": "Lung",
        "image": "Pulmonary Nodules/Google_25.jpg",
        "prevention": "quit smoking, enhance physical fitness",
        "description": "focal, quasi-circular, hyperdense parenchymal or sub-parenchymal pulmonary shadows with an intrapulmonary diameter of <3 cm on imaging",
        "cause": "pulmonary infection, chronic irritation",
        "symptom": "chest tightness, fatigue",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "This lung condition is characterized by focal, quasi-circular, hyperdense shadows within or just beneath the pulmonary tissue, recognizable on imaging due to their intrapulmonary diameter of less than 3 centimeters. It arises typically from pulmonary infections or chronic irritation, though it is non-infectious itself. Affected individuals might experience symptoms such as chest tightness and fatigue. To mitigate risks, quitting smoking and enhancing physical fitness are advised for prevention. Treatment options include both medical and surgical interventions, providing a comprehensive strategy for managing the condition."
    },
    {
        "entity": "Cyst Of Bladder",
        "location": "Bladder",
        "image": "Cyst Of Bladder/Google_20.jpg",
        "description": "a cyst of the bladder is a cystic dilatation of the submucosa of the bladder that protrudes into the bladder.",
        "prevention": "frequent physical examination",
        "cause": "not clear",
        "symptom": "urine frequency, urgency",
        "treatment": "surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "A bladder cyst is characterized by a cystic dilatation of the submucosa that intrudes into the organ. Although the exact cause remains unclear, symptoms typically include frequent and urgent urination. To help prevent its occurrence, frequent physical examinations are recommended. The condition is non-infectious and, when necessary, can be addressed through surgical intervention."
    },
    {
        "entity": "Alveolar Carcinoma",
        "location": "Lung",
        "image": "Alveolar Carcinoma/Google_22.jpg",
        "description": "is an early lung adenocarcinoma",
        "prevention": "no smoking, pay attention to the air environment",
        "cause": "smoking, radiation, atmospheric pollution, genetic factors",
        "symptom": "blood in sputum, chest pain, fever with cough",
        "treatment": "surgical treatment, drug treatment",
        "infectivity": "non-infectious",
        "chunk": "Lung adenocarcinoma, located in the lung, is a type of early cancerous condition typically caused by smoking, radiation, atmospheric pollution, and genetic factors. It manifests through symptoms such as blood in sputum, chest pain, and fever associated with a cough. While the disease is non-infectious, its prevention primarily involves abstaining from smoking and being mindful of air quality. Treatment options typically include surgical and drug interventions to address the malignancy."
    },
    {
        "entity": "Intestinal Neoplasms",
        "location": "Large Intestine",
        "image": "Intestinal Neoplasms/Google_21.jpg",
        "description": "tumors arising in the small and large intestine",
        "prevention": "eat a healthy diet and maintain good living habits",
        "cause": "unreasonable dietary structure, chronic colitis, environmental factors, genetic factors",
        "symptom": "abnormal defecation frequency, hematochezia, constipation",
        "treatment": "surgical treatment, supportive treatment, drug treatment",
        "infectivity": "non-infectious",
        "chunk": "Colon cancer is a medical condition characterized by tumors developing in the intestines, specifically in the large and small regions. It is not contagious and is linked to various causes including poor dietary habits, chronic colitis, environmental influences, and genetic predispositions. Symptoms often include changes in bowel movement frequency, the presence of blood in stool, and constipation. Preventative measures focus on adopting a balanced diet and maintaining healthy lifestyle choices. Treatment options typically involve surgical intervention, along with supportive and pharmaceutical therapies."
    },
    {
        "entity": "Pineal Cell Tumor",
        "location": "Pineal Gland",
        "image": "Pineal Cell Tumor/Google_08.jpg",
        "description": "pineal cell tumors are tumors that arise from pineal parenchymal cells.",
        "prevention": "regular physical examination",
        "cause": "not clear",
        "symptom": "headache, vomiting, fundus edema, eye movement disorder, hearing impairment",
        "treatment": "surgical treatment, supportive treatment, rehabilitation treatment",
        "infectivity": "non-infectious",
        "chunk": "Pineal cell tumors are characterized by their origin in the pineal parenchymal cells, located in the pineal gland. These tumors are non-infectious and have unclear causes, making prevention through regular physical examination essential. Common symptoms include headache, vomiting, fundus edema, eye movement disorder, and hearing impairment. Effective management involves a combination of surgical treatment, supportive treatment, and rehabilitation."
    },
    {
        "entity": "Breast Nodules",
        "location": "Breast",
        "image": "Breast Nodules/Google_19.jpg",
        "description": "breast nodules are cystic hyperplasia of the breast, a non-neoplastic disease",
        "prevention": "regular physical examination",
        "cause": "endocrine disorders, genetic factors",
        "symptom": "breast pain, breast mass",
        "treatment": "medical treatment, symptomatic treatment, rehabilitation treatment",
        "infectivity": "non-infectious",
        "susceptible population": "female of childbearing age",
        "chunk": "Breast nodules occur in the breast and are identified as cystic hyperplasia, which is a non-cancerous condition. They do not spread from person to person, as they are non-infectious. Common causes include endocrine disorders and genetic factors, while typical symptoms involve breast pain and the presence of a breast mass. To manage this condition, various treatments can be employed, including medical intervention, addressing symptoms directly, and rehabilitation strategies. Regular physical examinations can serve as a preventive measure to identify or mitigate potential issues early. This condition predominantly affects women in their childbearing years, making them the most vulnerable group."
    },
    {
        "entity": "Hepatitis",
        "location": "Liver",
        "image": "Hepatitis/Google_10.jpg",
        "description": "hepatitis is the general term for hepatic inflammation.",
        "prevention": "early detection, early diagnosis, early treatment",
        "cause": "viral factors, bacteria, parasites, drugs, alcohol",
        "symptom": "loss of appetite, abdominal distension, nausea and vomiting, and anorexia to greasy food",
        "treatment": "medical therapy, supportive therapy",
        "infectivity": "mother-to-child transmission, iatrogenic transmission, blood transfusion transmission, close life contact transmission, sexual transmission",
        "chunk": "Hepatitis is a general term for hepatic inflammation that primarily affects the liver. This condition can be caused by a variety of factors, including viral infections, bacteria, parasites, drugs, and alcohol, and it is known for symptoms such as loss of appetite, abdominal distension, nausea and vomiting, and an aversion to greasy food. Transmission can occur through several routes, including mother-to-child, medical procedures, blood transfusions, close personal contact, and sexual activity. Prevention focuses on early detection, diagnosis, and treatment to manage and mitigate the disease's impact. Treatments typically involve medical and supportive therapies aimed at alleviating symptoms and addressing underlying causes."
    },
    {
        "entity": "Bladder Neoplasms",
        "location": "Bladder",
        "image": "Bladder Neoplasms/Google_31.jpg",
        "description": "bladder tumors are the most common tumors of the urinary system",
        "prevention": "strengthen labor protection, reduce exposure to exogenous carcinogens, and drink more water and urinate in time at ordinary times",
        "cause": "not clear, possibly related to chemical carcinogens",
        "symptom": "abdominal mass, voiding pain, frequent urination, bladder irritation symptoms",
        "treatment": "surgical treatment, medical treatment, supportive treatment",
        "infectivity": "non-infectious",
        "chunk": "Bladder tumors are the most common tumors of the urinary system and occur in the bladder. Although the exact cause is not clear, there is a possible link to chemical carcinogens. Symptoms include an abdominal mass, pain during urination, frequent urination, and irritation of the bladder. These tumors are non-infectious and can be treated through surgical, medical, or supportive methods. To prevent their occurrence, it is advisable to strengthen labor protection, limit exposure to exogenous carcinogens, and maintain good hydration with timely urination."
    },
    {
        "entity": "Splenic Aneurysm",
        "location": "Artery",
        "image": "Splenic Aneurysm/Google_22.jpg",
        "description": "splenic aneurysm is the most common aneurysm in visceral artery",
        "prevention": "early detection, early diagnosis, early treatment",
        "cause": "atrophy and defect of the middle tissue and elastic fiber layer of the splenic artery",
        "symptom": "hepatosplenomegaly, ascites, upper abdominal pain, nausea and vomiting",
        "treatment": "surgical treatment, rehabilitation treatment, supportive treatment",
        "infectivity": "non-infectious",
        "chunk": "A splenic aneurysm is a condition occurring in an artery, primarily recognized as the most prevalent aneurysm within the visceral artery system. It arises due to the atrophy and defects in the middle tissue and elastic fiber layer of the splenic artery. Though not infectious, it can cause significant symptoms such as hepatosplenomegaly, ascites, upper abdominal pain, nausea, and vomiting. Prevention is centered around early detection, diagnosis, and treatment, which can significantly mitigate potential complications. Treatment approaches include surgical intervention, supported by rehabilitation and supportive care to ensure comprehensive management of the condition."
    },
    {
        "entity": "Splenic Cyst",
        "location": "Spleen",
        "image": "Splenic Cyst/Google_21.jpg",
        "description": "tumor-like cystic lesions of splenic tissue",
        "prevention": "healthy diet and exercise",
        "cause": "parasite",
        "symptom": "upper abdominal discomfort, constipation, dyspepsia",
        "treatment": "surgical treatment, drug treatment",
        "infectivity": "non-infectious",
        "chunk": "Splenic cysts are non-infectious tumor-like cystic lesions found in the spleen, often caused by parasitic infections. Individuals may experience symptoms such as upper abdominal discomfort, constipation, and dyspepsia. While these cysts are not infectious, maintaining a healthy diet and regular exercise can serve as preventative measures. Treatment options typically include surgical intervention and drug therapy to manage or remove the lesions."
    },
    {
        "entity": "Glioma",
        "location": "Brain",
        "image": "Glioma/Google_47.jpg",
        "description": "gliomas are primary brain tumors arising from the canceration of glial cells of the brain and spinal cord.",
        "prevention": "away from carcinogenic factors",
        "cause": "genetic factors, chemical factors, radioactive radiation",
        "symptom": "hydrocephalus, holder instability, mental disorders, ataxia, increased intracranial pressure, sensory disorders",
        "treatment": "comprehensive treatment based on surgery",
        "infectivity": "non-infectious",
        "chunk": "Gliomas are primary tumors located in the brain, originating from the malignant transformation of glial cells within the central nervous system, including both the brain and spinal cord. Their development is influenced by genetic predispositions, exposure to certain chemicals, and radioactive radiation. Preventative measures focus on minimizing contact with carcinogenic agents. Clinically, these tumors can cause a range of symptoms such as hydrocephalus, instability in posture or movement, mental health disturbances, poor coordination, heightened pressure within the skull, and sensory impairment. Although not infectious, their management typically involves a combination of treatments, primarily centered around surgical interventions, to address the complex nature of the condition."
    },
    {
        "entity": "Gastric Ulcer",
        "location": "Stomach",
        "image": "Gastric Ulcer/Google_12.jpg",
        "description": "gastric ulcer is an ulcer that occurs in the corners of the stomach, antrum, cardia, hiatal hernia, etc. it is a kind of peptic ulcer.",
        "prevention": "pay attention to dietary hygiene and strengthen physical fitness",
        "cause": "helicobacter pylori infection, drug factors, dietary problems, genetic factors",
        "symptom": "upper abdominal pain",
        "treatment": "pharmacotherapy, rehabilitation",
        "infectivity": "non-infectious",
        "chunk": "A gastric ulcer is a type of peptic ulcer found in various parts of the stomach such as the antrum, cardia, and near a hiatal hernia. It can be prevented by maintaining dietary hygiene and strengthening one’s physical fitness. Its primary causes include infection by Helicobacter pylori, as well as other factors like certain medications, dietary issues, and genetics. The main symptom is pain in the upper abdomen, and it is treated with medication and rehabilitation. This condition is non-infectious."
    },
    {
        "entity": "Congenital Diseases Of Nervous System",
        "location": "Nervous System",
        "image": "Congenital Diseases Of Nervous System/Google_19.jpg",
        "description": "nervous system congenital diseases are acquired neurogenesis or developmental defects caused by multiple pathogenic factors during embryonic development.",
        "prevention": "pay attention to maternal and infant perinatal care and neonatal feeding care",
        "cause": "it is not clear, possibly related to teratogenic factors on embryonic development",
        "symptom": "skull and spine deformities, neurological deficits, metabolic dysfunction, speech dysfunction",
        "treatment": "pharmacotherapy, rehabilitation",
        "infectivity": "non-infectious",
        "alias": "neurodevelopmental disorders",
        "susceptible population": "fetus",
        "chunk": "Neurodevelopmental disorders occur within the nervous system and are congenital diseases resulting from neurogenesis or developmental defects caused by various pathogenic factors during embryonic development. While the exact cause remains unclear, it is believed to be potentially related to teratogenic influences on the developing embryo. These disorders are non-infectious and predominantly affect fetuses, leading to symptoms such as skull and spine deformities, neurological deficits, metabolic dysfunction, and speech difficulties. Prevention focuses on maternal and infant perinatal care and proper neonatal feeding practices. Treatment typically involves pharmacotherapy and rehabilitation."
    },
    {
        "entity": "Esophageal Cyst",
        "location": "Esophagus",
        "image": "Esophageal Cyst/Google_21.jpg",
        "description": "esophageal cysts are rare benign masses of the esophagus and are remnants of embryonic tissue",
        "prevention": "early detection, early diagnosis, early treatment",
        "cause": "unknown etiology or congenital developmental malformation",
        "symptom": "chest pain, dyspnea, dysphagia, cysts",
        "treatment": "medical therapy, supportive therapy",
        "infectivity": "non-infectious",
        "chunk": "Esophageal cysts are rare benign masses found in the esophagus and are considered remnants of embryonic tissue. Their exact cause is unclear, with possibilities including an unknown etiology or congenital developmental malformations. Symptoms can include chest pain, difficulty breathing (dyspnea), difficulty swallowing (dysphagia), and the presence of cysts. These cysts are non-infectious and generally do not spread from person to person. Preventative strategies focus on early detection, diagnosis, and treatment to manage symptoms and prevent complications. Treatment typically involves medical and supportive therapies to alleviate symptoms and improve quality of life."
    },
    {
        "entity": "Atelectasis",
        "location": "Lung",
        "image": "Atelectasis/Google_41.jpg",
        "prevention": "quit smoking, enhance physical fitness",
        "description": "atelectasis refers to a decrease in the volume or air content of one or more lung segments or lobes",
        "cause": "bronchial obstruction",
        "symptom": "chest tightness, shortness of breath, difficulty breathing, dry cough",
        "treatment": "physical therapy, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Atelectasis is a condition affecting the respiratory system where there is a decrease in the volume or air content of one or more lung segments or lobes. It is primarily caused by bronchial obstruction and is characterized by symptoms such as chest tightness, shortness of breath, difficulty breathing, and dry cough. Being a non-infectious condition, it does not spread between individuals. Strategies to prevent its onset include quitting smoking and enhancing physical fitness. For those affected, treatment options include physical therapy to help restore lung function, and in some cases, surgical treatment may be necessary to address the underlying causes of the obstruction."
    },
    {
        "entity": "Cardiomegaly",
        "location": "Heart",
        "image": "Cardiomegaly/Google_08.jpg",
        "prevention": "live healthy, enhance physical fitness",
        "description": "increase of heart volume",
        "cause": "hypertension, dilated cardiomyopathy",
        "symptom": "chest tightness, arrhythmia",
        "treatment": "physical therapy, medication",
        "infectivity": "non-infectious",
        "chunk": "Cardiomegaly is a condition characterized by an increase in heart volume and is primarily caused by hypertension and dilated cardiomyopathy. Those affected may experience symptoms such as chest tightness and arrhythmia. Although non-infectious by nature, it requires attention to ensure proper management and relief. Effective treatment often involves a combination of physical therapy and medication, tailored to address the underlying causes and mitigate symptoms. Preventative measures focus on leading a healthy lifestyle and enhancing physical fitness to reduce the risk of developing the condition."
    },
    {
        "entity": "Pleural Effusion",
        "prevention": "live healthy, enhance physical fitness",
        "image": "Pleural Effusion/Google_08.jpg",
        "description": "excessive fluid accumulation in the pleural cavity",
        "cause": "inflammation, malignant tumor, trauma, etc",
        "symptom": "chest tightness, dyspnea, chest pain",
        "treatment": "medical treatment, surgical treatment",
        "infectivity": "non-infectious",
        "chunk": "Pleural effusion is characterized by excessive fluid accumulation in the pleural cavity and can result from various causes including inflammation, malignant tumors, or trauma. Those experiencing this condition may have symptoms such as chest tightness, dyspnea, and chest pain. Though it is non-infectious, addressing it may require medical or surgical treatment. To prevent it, maintaining a healthy lifestyle and enhancing physical fitness can be beneficial."
    },
    {
        "entity": "Pulmonary Infiltration",
        "location": "Lung",
        "image": "Pulmonary Infiltration/Google_17.jpg",
        "prevention": "live healthy, enhance physical fitness",
        "description": "pulmonary infiltrate is a substance denser than air, such as pus, blood, or protein, which lingers within the parenchyma of the lungs",
        "cause": "inflammation, bacterial infection, etc",
        "symptom": "chest pain, cough, expectoration",
        "treatment": "medical treatment",
        "infectivity": "non-infectious",
        "chunk": "Pulmonary infiltrate involves a substance denser than air, including pus, blood, or protein, present within the lung parenchyma. It is chiefly caused by conditions like inflammation or bacterial infections, though it is non-infectious in nature. Individuals might experience symptoms such as chest pain, coughing, and expectoration. Preventative measures include living a healthy lifestyle and enhancing physical fitness. Treatment is typically medical in nature, addressing the underlying causes and alleviating symptoms."
    },
    {
        "entity": "Pneumothorax",
        "location": "Lung",
        "image": "Pneumothorax/Google_41.jpg",
        "description": "air enters the pleural cavity, causing an accumulation of gas",
        "prevention": "quit smoking, avoid strenuous exercise",
        "cause": "chest injury, lung disease, bullae",
        "symptom": "chest pain, dyspnea",
        "treatment": "medical therapy, supportive therapy",
        "infectivity": "non-infectious",
        "chunk": "A pneumothorax occurs when air enters the pleural cavity of the lung, resulting in a build-up of gas. Often caused by chest injury, lung disease, or the presence of bullae, it leads to symptoms such as chest pain and dyspnea. To reduce the risk, it is advisable to quit smoking and avoid strenuous exercise. Treatment options include medical and supportive therapy. It is important to note that this condition is non-infectious."
    },
    {
        "entity": "Motor System",
        "component": "bone, bone junctions, skeletal muscles",
        "image": "Motor System/Google_64.jpg",
        "function": "movement and support",
        "chunk": "The musculoskeletal system is essential for facilitating movement and providing structural support to the body. It comprises bones that serve as the framework and protect vital organs, bone junctions (joints) that connect bones and allow for a range of movements, and skeletal muscles that contract to produce voluntary movement and maintain posture. Together, these components work in harmony to enable motion, stability, and flexibility, playing a critical role in daily activities and overall physical health."
    },
    {
        "entity": "Spine",
        "position": "the median of back and the upper end is connected with the skull",
        "image": "Spine/Google_41.jpg",
        "characteristic": "gradual widening from top to bottom",
        "chunk": "The neck serves as a crucial part of the human anatomy, positioned medially at the back where its upper end connects directly with the skull. It is distinctively characterized by a gradual widening from top to bottom, allowing for both support and mobility. This design facilitates various functions, such as movement and structural support, which are essential for the balance and coordination of the head and trunk."
    },
    {
        "entity": "Digestive System",
        "component": "digestive tract, digestive gland",
        "image": "Digestive System/Google_26.jpg",
        "status": "one of the nine systems of the human body",
        "chunk": "The digestive system is integral to the human body, functioning as one of its nine essential systems. It comprises various components, including the oral cavity, pharynx, esophagus, stomach, small intestine, and large intestine, which together form the digestive tract. Alongside these, the digestive gland plays a crucial role in processing food, enabling nutrient absorption, and waste elimination. These components work cohesively to break down ingested food into usable energy and nutrients while efficiently managing waste products, underscoring the system's importance in maintaining overall health and enabling the body's growth, repair, and energy needs."
    },
    {
        "entity": "Oral Cavity",
        "definition": "initial part of digestive tract",
        "image": "Oral Cavity/Google_22.jpg",
        "chunk": "The esophagus is a muscular tube that serves as the initial part of the digestive tract, facilitating the movement of food and liquids from the throat to the stomach. It is an essential component of the human digestive system, playing a crucial role in swallowing by using coordinated muscle contractions known as peristalsis to propel ingested material downward."
    },
    {
        "entity": "Pharynx",
        "definition": "access to lung and stomach",
        "image": "Pharynx/Google_26.jpg",
        "function": "breathing, diet",
        "length": "about 12-14cm long",
        "chunk": "The trachea is a crucial part of the respiratory system, serving as a conduit for gases to and from the lungs and stomach. Measuring approximately 12-14cm in length, it facilitates essential functions like breathing and contributes to the digestive system by aiding dietary processes. Its role as a passage of gas underscores its importance in maintaining proper respiratory health."
    },
    {
        "entity": "Esophagus",
        "definition": "a passage made up of muscles",
        "image": "Esophagus/Google_40.jpg",
        "position": "connect throat to stomach",
        "effect": "food delivery",
        "chunk": "The esophagus is a muscular passage that plays a crucial role in the digestive process by connecting the throat to the stomach. Its primary function is to facilitate the delivery of food from the mouth to the stomach, where digestion continues. The esophagus effectively transports food, using coordinated muscular contractions to ensure smooth passage, thus serving as an essential component of the digestive system."
    },
    {
        "entity": "Stomach",
        "function": "digest food, secrete enzymes",
        "image": "Stomach/Google_47.jpg",
        "position": "located below the diaphragm, connecting the upper esophagus and the lower intestine",
        "chunk": "The stomach is a vital organ in the digestive system, primarily responsible for breaking down food and releasing necessary enzymes to aid in digestion. Positioned just below the diaphragm, it acts as a conduit between the upper esophagus and the lower intestine. This strategic location allows it to effectively mix and process food as it transitions through the digestive tract."
    },
    {
        "entity": "Small Intestine",
        "component": "duodenum, jejunum, ileum",
        "image": "Small Intestine/Google_19.jpg",
        "position": "posterior superior part of abdominal cavity",
        "function": "absorb nutrients, secrete enzymes, digest food",
        "alias": "Small Bowel",
        "chunk": "The small intestine, also known as the small bowel, is situated in the posterior superior part of the abdominal cavity. Comprising the duodenum, jejunum, and ileum, it plays a critical role in the digestive process. Its primary functions include the absorption of nutrients, secretion of essential enzymes, and the digestion of food, making it integral to maintaining the nutritional and digestive health of the body."
    },
    {
        "entity": "Jejunum",
        "definition": "the posterior portion of the small intestine and duodenum in mammals",
        "image": "Jejunum/Google_08.jpg",
        "position": "left superior side of abdominal cavity",
        "chunk": "The jejunum is an integral part of the mammalian digestive system, specifically being a segment in the posterior region of the small intestine, following the duodenum. Its location is identifiable on the left superior side of the abdominal cavity. As a key site for nutrient absorption, it plays a crucial role in the digestive process, with its structure and placement allowing it to effectively continue digestion that begins in the stomach and duodenum."
    },
    {
        "entity": "Large Intestine",
        "component": "colon, rectum",
        "image": "Large Intestine/Google_26.jpg",
        "definition": "an important component of the digestive system",
        "function": "protect mucosa and lubricate feces",
        "chunk": "The large intestine is an essential part of the digestive system, comprised primarily of the colon and rectum. Its main role is to protect the mucosal lining and to facilitate the lubrication of feces, ensuring smooth and efficient waste elimination."
    },
    {
        "entity": "Colon",
        "definition": "an important component of the digestive system",
        "image": "Colon/Google_39.jpg",
        "function": "digest food, absorb water, excrete body waste",
        "chunk": "The intestines are an important component of the digestive system, primarily responsible for the critical processes of digesting food, absorbing water, and excreting body waste. As food travels through, digestive enzymes break down nutrients for absorption into the bloodstream, while water is retrieved to maintain fluid balance in the body. The remaining waste is then formed into stool, ready for excretion, thereby efficiently managing waste removal and ensuring the body remains nourished and hydrated."
    },
    {
        "entity": "Rectum",
        "definition": "the last section of the bowel",
        "image": "Rectum/Google_08.jpg",
        "function": "store feces, excrete feces",
        "chunk": "The rectum is an integral part of the digestive system, serving a critical role in the body's excretory processes. It acts as the final section of the bowel, where it functions primarily to store feces temporarily. This storage period allows for the accumulation and eventual excretion of waste from the body. By controlling the release of feces, it ensures waste is expelled at appropriate times, contributing to the maintenance of overall digestive health and balance within the gastrointestinal tract."
    },
    {
        "entity": "Gallbladder",
        "position": "pear-shaped pouch structure behind right subcostal liver",
        "image": "Gallbladder/Google_41.jpg",
        "effect": "concentration and storage of bile",
        "component": "mucosa, muscularis, adventitia",
        "function": "bile can be directly discharged into the intestine to participate in digestive function",
        "divided into": "bottom, body, neck and tube",
        "chunk": "The gallbladder is a small, pear-shaped organ positioned behind the liver and plays a crucial role in the digestive system by concentrating and storing bile, a fluid necessary for digestion. Structurally, it consists of layers including mucosa, muscularis, and adventitia. It facilitates digestion by directly discharging bile into the intestine. Anatomically, it is divided into four parts: the bottom, body, neck, and tube."
    },
    {
        "entity": "Mesentery",
        "divided into": "mesoappendix, transverse mesocolon",
        "image": "Mesentery/Google_33.jpg",
        "definition": "a part of the peritoneum that suspends and fixes an intestinal tube",
        "chunk": "The mesentery is a structure within the peritoneum that plays a crucial role in supporting and stabilizing the intestines. It is anatomically divided into parts, including the mesoappendix and the transverse mesocolon, each serving to attach specific portions of the intestinal tube to the abdominal wall. By securing the intestines in place, it ensures proper alignment and function of the digestive system within the abdominal cavity."
    },
    {
        "entity": "Nasal Cavity",
        "tissue structure": "nasal vestibule, mucosa, blood vessel, lymph, nerve",
        "image": "Nasal Cavity/Google_23.jpg",
        "position": "human head",
        "chunk": "The nose is a prominent feature located on the human head, characterized by its complex tissue structures, including the nasal vestibule, mucosa, blood vessels, lymph, and nerves. The nasal vestibule serves as the entrance to the nasal cavity, playing a crucial role in filtering and protecting the respiratory tract. The mucosa is a moist tissue lining the nasal passages, essential for humidifying and warming inhaled air, while also trapping dust and microbes. Blood vessels are abundant, providing necessary circulation to support these functions and contribute to the nose's healing and immune response. Lymphatic tissue aids in immune defense, capturing and destroying pathogens. Nerves within this structure are responsible for olfactory sensation, contributing to the sense of smell and providing various sensory feedback crucial for human perception and response to the environment."
    },
    {
        "entity": "Trachea",
        "component": "cartilage, muscle, connective tissue, mucosa",
        "image": "Trachea/Google_36.jpg",
        "wall composition": "mucosa, submucosa, adventitia",
        "cell composition": "ciliated cells, goblet cells, basal cells",
        "function": "gas delivery",
        "chunk": "The trachea is a vital part of the respiratory system, composed of cartilage, muscle, connective tissue, and mucosa. Its wall structure includes layers of mucosa, submucosa, and adventitia, which contribute to its flexibility and support. Cellularly, it features a variety of specialized cells such as ciliated cells, goblet cells, and basal cells. The primary function of this structure is the efficient delivery of gases, ensuring that air is effectively transported to and from the lungs."
    },
    {
        "entity": "Lung",
        "function": "breathe",
        "image": "Lung/Google_39.jpg",
        "position": "pleural",
        "component": "bronchi, alveoli, blood vessels, lymphatic vessels",
        "chunk": "Lungs are a part of the chest and are vital organs.The most important function of lung is to breathe. Situated in the pleural cavities of the thoracic region, they maintain a crucial role in the respiratory system. Their intricate internal structure includes bronchi, which branch into smaller passages throughout the organ, and alveoli, where gas exchange occurs at a micro level. Rich networks of blood vessels facilitate the transportation of gases to and from the heart, ensuring efficient circulation and oxygenation of blood. Additionally, lymphatic vessels support immune function by removing waste and excess fluids, contributing to overall respiratory health."
    },
    {
        "entity": "Liver",
        "definition": "an organ in the body that has a predominant metabolic function",
        "image": "Liver/Google_43.jpg",
        "position": "right upper abdomen, hidden under diaphragm and deep ribs",
        "texture": "normal liver is reddish brown with soft texture",
        "weight": "adults have liver weights equivalent to 2% of their body weight",
        "function": "biotransformation, detoxification",
        "chunk": "The liver is a vital organ situated in the upper right quadrant of the abdomen, just below the diaphragm and shielded by the deep ribs. It has a distinct reddish-brown color and a soft, pliable texture. This organ is central to numerous critical bodily functions, including biotransformation, which involves the chemical modification of substances, and detoxification, where harmful toxins are broken down and removed from the body. In addition, the liver plays a key role in regulating metabolism, processing nutrients from the digestive system, producing bile for digestion, and maintaining overall homeostasis. Without proper liver function, many of the body's metabolic processes would be severely impaired."
    },
    {
        "entity": "Chest",
        "function": "breathe",
        "image": "Lung/Google_53.jpg",
        "position": "pleural",
        "component": "Lung",
        "chunk": "The chest, or thorax, is the area of the body located between the neck and the abdomen. It houses several vital organs, including the heart and lungs, which are protected by the ribcage. The chest plays a key role in respiration, as the lungs expand and contract within the thoracic cavity to allow for breathing. Muscles like the diaphragm and intercostal muscles assist in this process. The chest also contains major blood vessels such as the aorta and the pulmonary arteries. Proper chest function is essential for oxygen delivery and circulation throughout the body."
    },
    {
        "entity": "Diaphragm",
        "function": "helping the lungs breathe",
        "image": "Diaphragm/Google_32.jpg",
        "definition": "separation between thoracic and abdominal cavity",
        "chunk": "The diaphragm is a crucial anatomical structure involved in respiratory function, serving as a muscular partition that separates the thoracic cavity, which contains the lungs and heart, from the abdominal cavity. By contracting and flattening during inhalation, it allows the lungs to expand, facilitating the intake of air, while its relaxation aids in exhalation by reducing the volume of the thoracic cavity. This muscle plays a vital role in the breathing process by controlling the pressure differences between these two cavities."
    },
    {
        "entity": "Urinary System",
        "component": "kidney, ureter, bladder and urethra",
        "image": "Urinary System/Google_25.jpg",
        "function": "excretion",
        "chunk": "The urinary system is responsible for excretion and comprises the kidney, ureter, bladder, and urethra. Its primary function involves filtering waste products and excess substances from the bloodstream, balancing electrolytes, and maintaining a stable internal environment through urine production and expulsion. The kidneys are the central filtration units, cleansing the blood of toxins and transforming waste into urine. This urine then travels through the ureters, reaching the bladder, where it is temporarily stored. Upon reaching a threshold volume, urine is expelled from the body through the urethra during the process of urination. Efficient functioning of all components ensures regulation of blood pressure, control of red blood cell production, and maintenance of various metabolic processes."
    },
    {
        "entity": "Kidney",
        "position": "both sides of the spine, close to the posterior abdominal wall",
        "image": "Kidney/Google_41.jpg",
        "shape": "faba bean",
        "function": "discharge waste, adjust water and osmotic pressure balance",
        "chunk": "Kidneys are essential organs located on each side of the spine near the back of the abdominal cavity. Resembling the shape of a faba bean, these organs play a crucial role in maintaining the body's internal environment. Their primary function is to remove waste products from the bloodstream, effectively filtering and excreting them through urine. Additionally, they are instrumental in regulating the body's water balance, ensuring that fluid levels remain optimal, and maintaining the osmotic pressure balance to support cellular function and overall homeostasis."
    },
    {
        "entity": "Ureter",
        "uplink": "renal pelvis",
        "image": "Ureter/Google_41.jpg",
        "downlink": "bladder",
        "shape": "elongated pipe, flat cylindrical",
        "characteristic": "stones and necrotic tissues tend to stay",
        "diameter": "2-5mm",
        "function": "delivery of urine",
        "chunk": "The ureter functions primarily as a conduit for the delivery of urine, connecting the renal pelvis to the bladder. Its shape is akin to an elongated pipe or a flat cylindrical structure, with a diameter ranging between 2 to 5 millimeters. A notable characteristic is its propensity to harbor stones and necrotic tissues, which can impede its function."
    },
    {
        "entity": "Bladder",
        "definition": "urinary storage organs",
        "image": "Bladder/Google_36.jpg",
        "position": "intrapelvic",
        "function": "store urine",
        "chunk": "The urinary bladder is a crucial component of the urinary system, serving as the primary reservoir for storing urine. Positioned within the pelvic region, it plays a vital role in maintaining bodily waste management processes by temporarily holding urine prior to excretion. This bladder's intrapelvic location allows it to efficiently collect and retain urine produced by the kidneys, ensuring proper waste removal and fluid balance within the body."
    },
    {
        "entity": "Urethra",
        "definition": "pipeline from bladder to the outside of body",
        "image": "Urethra/Google_40.jpg",
        "function": "deliver urine",
        "chunk": "The urethra serves as a vital conduit that facilitates the expulsion of urine from the bladder to the outside of the body. This essential function of delivering urine is a key component of the urinary system, playing a crucial role in maintaining the body's fluid balance and excretion process."
    },
    {
        "entity": "Reproductive System",
        "function": "reproductive progeny",
        "image": "Reproductive System/Google_39.jpg",
        "chunk": "This entity is responsible for the production and development of offspring, playing a crucial role in the continuation of genetic lineage and ensuring the propagation of its species. Through various biological mechanisms, it facilitates the creation of new individuals, contributing to the diversity and sustainability of the population over generations."
    },
    {
        "entity": "Uterus",
        "position": "central pelvic cavity",
        "image": "Uterus/Google_40.jpg",
        "shape": "inverted triangle",
        "function": "a place to give birth to new life",
        "chunk": "The uterus is an essential organ located centrally within the pelvic cavity and has a distinctive inverted triangular shape. Its primary function is to provide a nurturing environment where new life can develop, ultimately facilitating the process of childbirth."
    },
    {
        "entity": "Vagina",
        "function": "sexual organ",
        "image": "Vagina/Google_08.jpg",
        "chunk": "The penis serves as a sexual organ, playing a critical role in human reproduction. It is integral in the delivery of sperm to the female reproductive system during sexual intercourse. In addition to its reproductive function, it is also involved in the excretion of urine from the body. The organ is sensitive to stimuli, facilitating sexual arousal and pleasure through a complex interplay of anatomical and physiological processes."
    },
    {
        "entity": "Prostate",
        "definition": "male-specific gonadal organs",
        "image": "Prostate/Google_34.jpg",
        "shape": "chestnut-like bottom up, tip down",
        "size": "about 4cm transverse, about 3cm vertical, about 2cm anterior and posterior",
        "effect": "secretion and control of urination",
        "chunk": "The prostate gland is a male-specific organ located below the bladder, playing a crucial role in the secretion necessary for reproductive functionality and also influencing the control of urination. It is approximately the size of a chestnut and has a distinctive shape with a broader base that tapers to a pointed tip, oriented bottom up and tip down. In terms of dimensions, it measures roughly 4 centimeters in width, 3 centimeters in height, and 2 centimeters in depth. Its primary functions involve the secretion of fluid that nourishes and transports sperm, as well as contributing to urinary control mechanisms."
    },
    {
        "entity": "Thymus",
        "weight": "10-15g",
        "image": "Thymus/Google_25.jpg",
        "position": "posterior sternum",
        "colour": "gray-red",
        "shape": "flat ellipse",
        "characteristic": "is the body's first aging organ",
        "function": "immune organ, endocrine organ",
        "chunk": "The thymus is an immune and endocrine organ located behind the sternum, characterized by its gray-red color and flat, elliptical shape. Typically weighing between 10 to 15 grams, it serves as the body's first aging organ. Its primary functions involve playing a crucial role in the development of the immune system by producing T-cells essential for adaptive immunity and contributing to the body's endocrine activities."
    },
    {
        "entity": "Circulatory System",
        "component": "extracellular fluids of organisms",
        "image": "Circulatory System/Google_19.jpg",
        "chunk": "Extracellular fluids of organisms encompass the various fluid environments located outside of cells within an organism, playing critical roles in maintaining homeostasis, facilitating nutrient and waste exchange, and enabling cell communication. These fluids, which include blood plasma, interstitial fluid, lymph, and cerebrospinal fluid, serve as mediums for transporting essential molecules such as oxygen, hormones, and electrolytes, while also removing metabolic waste products from cellular activity. Their composition and volume are tightly regulated by mechanisms such as filtration, diffusion, and active transport to ensure the proper functioning of tissues and organs. Additionally, they provide structural support and protection for cells and contribute to the body's immune defense by circulating antibodies and other immune cells."
    },
    {
        "entity": "Heart",
        "component": "myocardium",
        "image": "Heart/Google_41.jpg",
        "four chambers": "left atrium, left ventricle, right atrium, right ventricle",
        "length": "about 15cm",
        "weight": "about 250g",
        "number of heartbeats per year": "36 million times",
        "function": "promote blood flow",
        "position": "mid-left inferior thoracic cavity",
        "chunk": "The heart is a muscular organ located in the mid-left inferior thoracic cavity. It is primarily composed of the myocardium, a specialized type of muscle tissue. Structurally, it comprises four chambers: the left atrium, left ventricle, right atrium, and right ventricle, each playing a critical role in its function to promote blood flow throughout the body. The organ measures approximately 15 centimeters in length and weighs about 250 grams. It is remarkably efficient, beating around 36 million times per year, tirelessly working to circulate blood and maintain vital bodily functions."
    },
    {
        "entity": "Artery",
        "definition": "vessels emanating from the ventricles",
        "image": "Artery/Google_22.jpg",
        "function": "transport of blood",
        "chunk": "Blood vessels are critical components of the circulatory system that play a key role in transporting blood throughout the body. Originating from the heart's ventricles, they facilitate the distribution of oxygenated blood from the heart to various tissues and organs while also assisting in returning deoxygenated blood back to the heart. This essential function ensures that nutrients and oxygen reach all body parts and waste products are efficiently removed, maintaining overall physiological balance and health."
    },
    {
        "entity": "Vein",
        "definition": "vessels that return blood to the heart",
        "image": "Vein/Google_43.jpg",
        "function": "transport of blood",
        "chunk": "Veins are crucial components of the circulatory system, responsible for carrying blood back to the heart. Their primary purpose is to facilitate the transport of deoxygenated blood from various parts of the body towards the heart, enabling the maintenance of effective blood circulation and ensuring that oxygen-depleted blood is efficiently returned for re-oxygenation and nutrient replenishment. In performing these tasks, they play a key role in maintaining the overall balance and functionality of the cardiovascular system, supporting vital processes within the body."
    },
    {
        "entity": "Lymphatic System",
        "function": "important defense systems",
        "image": "Lymphatic System/Google_18.jpg",
        "component": "lymphatic vessels, lymphoid organs, lymph",
        "occurrence and development": "primitive to higher animals",
        "chunk": "The lymphatic system plays a crucial role in defense systems, providing essential protective functions across a broad range of species from primitive to higher animals. Integral to its structure are lymphatic vessels, which transport lymph—a fluid containing vital immune cells—and lymphoid organs, which include nodes and tissues that oversee immune responses. This complex network ensures that organisms maintain effective immune surveillance and response capabilities, helping to guard against infections and diseases by filtering out harmful substances and facilitating the transport of essential immune cells throughout the body."
    },
    {
        "entity": "Lymph Vessel",
        "essence": "confluence of capillary lymphatics",
        "image": "Lymph Vessel/Google_41.jpg",
        "characteristic": "thin diameter and thin wall",
        "chunk": "The entity signifies a natural intersection where small lymphatic vessels meet, distinguished by their slender diameter and delicate walls. These features allow the vessels to efficiently transport lymph fluid, contributing to the maintenance of fluid balance in the body's tissues and the immune system's functionality. The interaction of these capillary lymphatics exemplifies the intricate network of pathways responsible for draining interstitial fluids and supporting the body's overall health. The delicate and intricate nature of these components highlights their essential role in the lymphatic system's operation, aiding in the removal of waste and facilitating the immune response."
    },
    {
        "entity": "Lymph Node",
        "shape": "oval",
        "image": "Lymph Node/Google_41.jpg",
        "interruption": "Lymph Vessel",
        "function": "filter lymph, remove bacteria",
        "chunk": "The lymph node is an oval-shaped structure integral to the lymphatic system, acting as a filtration site for lymph. This biological structure plays a critical role in maintaining the body's immune function by filtering lymph and effectively removing bacteria and other pathogens. Positioned at interruptions of lymph vessels, it ensures that the lymph passing through is cleansed of potentially harmful microorganisms before it returns to the bloodstream, thus contributing to the body's defense mechanisms and overall health."
    },
    {
        "entity": "Bone Marrow",
        "definition": "hematopoietic tissue",
        "image": "Bone Marrow/Google_29.jpg",
        "classification": "red and yellow bone marrow",
        "function": "hematopoiesis, immunity and defense",
        "chunk": "Bone marrow is a type of hematopoietic tissue critical for the formation and development of blood cells. It exists in two forms, classified as red and yellow bone marrow, each serving distinct functions. The primary role of this tissue involves hematopoiesis, the process by which blood cells are produced, including red blood cells, white blood cells, and platelets. In addition to its fundamental role in generating blood cells, it plays an essential part in the body's immune responses and overall defense mechanisms, making it vital for maintaining health and combating diseases."
    },
    {
        "entity": "Spleen",
        "nature": "immune organ",
        "image": "Spleen/Google_39.jpg",
        "position": "relative to 9-11 ribs",
        "function": "improve the body's immunity",
        "chunk": "The spleen is an immune organ situated adjacent to the 9th to 11th ribs on the left side of the body, playing a critical role in enhancing the body's immune system. It functions as a blood filter, removing old or damaged blood cells and pathogens while also housing white blood cells that are vital for mounting an effective immune response. Through these processes, it contributes significantly to both innate and adaptive immunity."
    },
    {
        "entity": "Nervous System",
        "classification": "central and peripheral nervous systems",
        "image": "Nervous System/Google_45.jpg",
        "function": "regulation of physiological function activities",
        "chunk": "The nervous system oversees the regulation of physiological function activities across both the central and peripheral regions. It serves as a complex network responsible for transmitting signals between various parts of the body, thereby coordinating an organism’s response to internal and external stimuli. By integrating and processing information, it maintains homeostasis and enables vital functions such as movement, perception, cognition, and maintenance of internal environments. Through interactions between neurons and other cells, it facilitates communication throughout the body, ensuring the smooth execution of numerous involuntary and voluntary processes that are essential for survival and well-being."
    },
    {
        "entity": "Brain",
        "component": "telencephalon, diencephalon",
        "image": "Brain/Google_41.jpg",
        "definition": "the most advanced part of the nervous system",
        "function": "organs of thinking, regulating all activities in the body",
        "chunk": "The forebrain is recognized as the most advanced part of the nervous system. It consists of two main components: the telencephalon and the diencephalon. These components house the organs responsible for higher cognitive processes, commonly referred to as thinking, and play a crucial role in the regulation of all bodily activities."
    },
    {
        "entity": "Cerebral Hemisphere",
        "component": "internal cerebral nucleus and external cerebral cortex",
        "image": "Cerebral Hemisphere/Google_20.jpg",
        "definition": "the cerebral hemisphere is part of the brain",
        "function": "controlling body motion and sensation",
        "chunk": "The cerebral hemisphere is part of the brain that consists of two main components: the internal cerebral nucleus and the external cerebral cortex. Its primary function is to control body motion and sensation, playing a crucial role in coordinating and processing various physical movements and sensory information."
    },
    {
        "entity": "Diencephalon",
        "position": "above the brainstem, the caudate nucleus and the medial side of the internal capsule",
        "image": "Diencephalon/Google_08.jpg",
        "chunk": "The thalamus is positioned above the brainstem, adjacent to the caudate nucleus, and on the medial side of the internal capsule. It plays a crucial role in relaying motor and sensory signals to the cerebral cortex and is involved in the regulation of sleep, consciousness, and alertness. As a key structure within the diencephalon, it acts as a central hub for processing various neural signals, influencing how information from different senses is integrated and perceived. This central location allows it to effectively coordinate complex functions within the brain, making it essential for maintaining cognitive functions and processing sensory input."
    },
    {
        "entity": "Brainstem",
        "position": "below the brain",
        "image": "Brainstem/Google_31.jpg",
        "function": "maintain individual life, control heartbeat and breathing",
        "chunk": "The medulla oblongata is located below the brain and plays a vital role in maintaining individual life by controlling essential autonomic functions such as heartbeat and breathing. These involuntary processes are crucial for survival, and the anatomical position of this structure allows it to receive and send information between the brain and the rest of the body, effectively regulating these physiological activities to ensure that the body's internal environment remains stable."
    },
    {
        "entity": "Midbrain",
        "effect": "reflex centers of vision and hearing",
        "image": "Midbrain/Google_29.jpg",
        "position": "just above the pons is the midpoint of the whole brain",
        "chunk": "The midbrain is involved in the reflex centers of vision and hearing, playing a crucial role in processing sensory information and coordinating responses. It is strategically located just above the pons at the midpoint of the brain, integrating neural processes and serving as a critical conduit for nerve pathways. This positioning underscores its essential function in connecting various brain regions and facilitating the relay of information across the central nervous system."
    },
    {
        "entity": "Pons",
        "position": "superior medulla oblongata",
        "image": "Pons/Google_31.jpg",
        "function": "adjust breathing",
        "chunk": "Located at the superior medulla oblongata, the structure is responsible for regulating respiratory rhythms. By monitoring the levels of carbon dioxide and oxygen in the blood, it plays a vital role in maintaining homeostasis and ensuring the body's metabolic demands are met through efficient breathing adjustments."
    },
    {
        "entity": "Medulla Oblongata",
        "function": "processing sensory and motor message delivery",
        "image": "Medulla Oblongata/Google_08.jpg",
        "position": "anterior cerebellum",
        "shape": "inverted cone",
        "chunk": "The anterior lobe of the cerebellum, located at the front region of the cerebellum, plays a crucial role in processing and delivering sensory and motor messages. This part of the brain is responsible for coordinating complex motor tasks and ensuring smooth and precise movements by integrating sensory input with motor commands. Its shape, reminiscent of an inverted cone, allows it to efficiently manage these processes, contributing to maintaining balance and posture. By orchestrating the fine-tuning of motor activity through its specific location and form, it is integral to the overall function of the cerebellum in the central nervous system."
    },
    {
        "entity": "Cerebellum",
        "component": "cerebellar hemisphere, cerebellar tonsil",
        "image": "Cerebellum/Google_41.jpg",
        "function": "maintain balance and integrate nerve impulses",
        "position": "intracranial fossa",
        "chunk": "The cerebellum is a crucial brain structure located in the intracranial fossa. It plays an essential role in maintaining balance and integrating nerve impulses, ensuring coordinated movement and posture. This complex entity comprises multiple components, including the cerebellar hemisphere and cerebellar tonsil, both of which contribute to its overall function by processing sensory information and fine-tuning motor activities."
    },
    {
        "entity": "Spinal Cord",
        "position": "spinal canal composed of vertebrae",
        "image": "Spinal Cord/Google_41.jpg",
        "shape": "long cylindrical shape",
        "length": "41-45cm",
        "effect": "bridge between brain and peripheral nerve",
        "chunk": "The spinal cord is a crucial component of the central nervous system, distinguished by its long cylindrical shape and length of 41-45 cm. Located within the spinal canal, which is formed by the vertebrae, it serves as an essential conduit for transmitting information between the brain and peripheral nerves. Its function as a bridge facilitates the communication necessary for motor and sensory activities, effectively linking the central nervous processing with various parts of the body to enable coordinated movement and reflex actions."
    },
    {
        "entity": "Ventricle",
        "definition": "lacunae within the brain",
        "image": "Ventricle/Google_41.jpg",
        "chunk": "Perivascular spaces are gaps or cavities found within the brain. These spaces are fluid-filled areas that surround blood vessels, playing a critical role in the brain's lymphatic system by allowing the transport of fluids and solutes into and out of the brain. Their presence is significant in maintaining normal brain function and homeostasis, contributing to the clearance of metabolic waste and potentially mediating neurovascular health. These spaces can also expand in certain pathological conditions, providing insights into various neurological disorders and their progression. Understanding these spaces is crucial for diagnosing and researching various brain-related health issues."
    },
    {
        "entity": "Choroid Plexus",
        "position": "ventricle",
        "image": "Choroid Plexus/Google_21.jpg",
        "effect": "product cerebrospinal fluid as a buffer medium",
        "chunk": "The ventricular system functions as a network of interconnected cavities within the brain, primarily involved in producing cerebrospinal fluid (CSF), which serves as a critical buffer medium. This specialized fluid circulates around and within the brain and spinal cord, providing cushioning to protect these central nervous system components from trauma. Additionally, the CSF plays a vital role in maintaining homeostasis by removing metabolic waste, distributing nutrients, and facilitating chemical stability in the neural environment. The balance and flow of cerebrospinal fluid are essential in ensuring the proper functioning and protection of the brain's intricate neural pathways."
    },
    {
        "entity": "Sense Organ",
        "definition": "an organ that senses changes in its surroundings.",
        "image": "Sense Organ/Google_33.jpg",
        "chunk": "A receptor is an organ that detects and responds to changes in its environment, playing a critical role in processing sensory information. These specialized structures enable organisms to perceive and interact with their surroundings by converting external stimuli into electrical signals that can be interpreted by the nervous system. Through this function, they contribute to maintaining homeostasis by allowing for appropriate responses to environmental fluctuations, such as changes in temperature, pressure, light, or chemical signals."
    },
    {
        "entity": "Eye",
        "nature": "visual organ",
        "image": "Eye/Google_51.jpg",
        "color": "brown, green, light brown, blue, black",
        "eyelid type": "binocular eyelid, single eyelid",
        "effect": "sensing light",
        "chunk": "The human eye functions as a visual organ, crucial for perceiving the surrounding environment by sensing light. It exhibits a variety of colors, such as brown, green, light brown, blue, and black, contributing to individual appearance. The structure of this organ includes different eyelid types, which can be either binocular or single, further varying among individuals. Through intricate processes involving these attributes, it plays a vital role in vision and interpretation of visual stimuli."
    },
    {
        "entity": "Ear",
        "nature": "organ of hearing",
        "image": "Ear/Google_37.jpg",
        "component": "outer ear, middle ear, inner ear",
        "function": "receive sound",
        "chunk": "The ear is an organ of hearing that is structured into three main components: the outer ear, the middle ear, and the inner ear. Each component plays a crucial role in the organ’s primary function, which is to receive sound. The outer ear captures sound waves and funnels them through the ear canal to the middle ear, where these waves cause the eardrum to vibrate. These vibrations are transmitted via three small bones in the middle ear, amplifying them towards the inner ear. In the inner ear, the vibrations are converted into electrical signals by the cochlea, which are then sent to the brain, allowing the perception and interpretation of sounds."
    },
    {
        "entity": "Nose",
        "nature": "olfactory organ",
        "image": "Nose/Google_31.jpg",
        "characteristic": "highly differentiated organs that sense chemical stimuli",
        "function": "identify odors",
        "chunk": "The nose is an olfactory organ known for its highly differentiated structures that specialize in detecting chemical stimuli. It is primarily responsible for identifying odors, enabling the sense of smell. Through its advanced capability, it distinguishes various scents by analyzing chemical compounds in the air, playing a crucial role in sensory perception and contributing to experiences such as tasting food, detecting hazards, and appreciating fragrances."
    },
    {
        "entity": "Tympanic Membrane",
        "alias": "Eardrum",
        "image": "Tympanic Membrane/Google_12.jpg",
        "component": "elastic gray-white translucent film",
        "position": "between the external auditory canal and the tympanic cavity",
        "shape": "oval",
        "effect": "sensory sound wave",
        "chunk": "The eardrum, also known as the tympanic membrane, is an essential part of the auditory system comprising an elastic gray-white translucent film. Positioned between the external auditory canal and the tympanic cavity, its structure is typically oval in shape. Its primary function is to facilitate hearing by receiving sensory sound waves. These waves cause the membrane to vibrate, thereby playing a critical role in transmitting acoustic information to the inner ear for auditory processing."
    },
    {
        "entity": "Middle Ear",
        "effect": "propagating sound wave",
        "image": "Middle Ear/Google_26.jpg",
        "component": "tympanic cavity, eustachian tube, tympanic sinus, mastoid process",
        "chunk": "The middle ear consists of various components that work together to facilitate hearing by propagating sound waves. This section of the auditory system includes the tympanic cavity, which houses the ossicles responsible for transmitting sound vibrations from the eardrum to the inner ear. The eustachian tube serves a crucial role in equalizing air pressure on both sides of the eardrum, ensuring proper vibration and hearing function. Meanwhile, the tympanic sinus contributes to the structural integrity and arrangement of the middle ear space, and the mastoid process, with its air-filled cavities, aids in protecting the delicate structures within the ear while also participating in the processes of hearing and maintaining pressure equilibrium. Together, these components ensure efficient sound transmission and adaptation to environmental variations in pressure, all essential for optimal auditory perception."
    },
    {
        "entity": "Ossicle",
        "definition": "the smallest bone in the human body",
        "image": "Ossicle/Google_10.jpg",
        "number": "3 pieces each in left and right ears",
        "function": "shake each other, duplicate sound source, stimulate inner ear",
        "chunk": "The stapes is the smallest bone in the human body and is part of a group of three small bones found in each ear. Their primary function involves moving in response to sound waves, which allows them to duplicate the sound source and transmit these vibrations to stimulate the inner ear, playing a crucial role in the process of hearing."
    },
    {
        "entity": "Inner Ear",
        "nature": "components of the hearing system",
        "image": "Inner Ear/Google_37.jpg",
        "position": "between the tympanic cavity and the floor of the internal auditory canal",
        "component": "bone labyrinth and membrane labyrinth",
        "chunk": "The inner ear is a complex part of the auditory system, strategically positioned between the tympanic cavity and the base of the internal auditory canal. It comprises two main structures: the bony labyrinth and the membranous labyrinth. These components work together to facilitate the functions of hearing and balance by converting sound waves into nerve impulses and aiding in the detection of head movements. The intricate assembly and positioning play a critical role in processing auditory information and maintaining equilibrium within the body."
    },
    {
        "entity": "Cochlea",
        "position": "deep temporal bone",
        "image": "Cochlea/Google_03.jpg",
        "function": "conduct and sense sound waves",
        "chunk": "The cochlea is located in the deep temporal bone and plays a crucial role in the auditory system by conducting and sensing sound waves. This spiral-shaped, hollow bone structure transforms mechanical sound wave vibrations into electrical signals, which are then transmitted to the brain via the auditory nerve for interpretation. Its function is vital for the perception of sound, contributing to the ability to hear a wide range of frequencies and intensities, thus enabling communication and awareness of the surrounding auditory environment."
    },
    {
        "entity": "Parotid",
        "function": "secrete saliva, secrete enzymes",
        "image": "Parotid/Google_41.jpg",
        "nature": "salivary gland",
        "chunk": "The parotid gland serves as a major salivary gland, primarily responsible for secreting saliva and various enzymes. These secretions play a crucial role in the initial stages of digestion by breaking down starches in the mouth and facilitating smooth swallowing, while also helping to maintain oral hygiene."
    }
]